[
  {
    "title": "Assessing CHIPS Acts Value, Tariffs and Semi Equipment Growth",
    "source": "EE Times",
    "date": "2025-06-06",
    "link": "https://www.eetimes.com/assessing-chips-acts-value-tariffs-and-semi-equipment-growth/",
    "text": "design Lines SoC Designline Assessing CHIPS Acts Value, Tariffs and Semi Equipment Growth By Nitin Dahad 06.06.2025 0 Share Post Share on Facebook Share on Twitter I am one of those people who read a lot. But not novels. I read a lot about my world, whether I am working or not working. I follow the latest trends, I read interesting research papers, I see who is saying what. On the latter, the main item that caught my eye this week is T.J. Rodgers’ opinion piece in The Wall Street Journal , in which he compared semiconductor subsidies to welfare, explained how it was tried in 1987 and failed, and proposed that the 2022 CHIPS and Science Act is a repeat. His point is that good businesses do not need subsidies. It seems U.S. President Trump has that opinion too, having criticized the CHIPS Act ( calling it “horrible ”) in March of this year. It is now reported that the President’s administration is renegotiating some of the already announced grants to semiconductor firms, with U.S. Commerce Secretary Howard Lutnick saying this week that some awards may even be axed. Indeed, earlier this year the Peterson Institute for International Economics reported on an evaluation of the U.S. CHIPS Act that indicated that up to $7.1 billion in subsidized grants and loans might have been unnecessarily awarded to 10 financially strong companies. “These companies might have been driven mainly by the tax credits to make their investment commitments,” the report said. Partner Content View All The Opportunity for Liquid Sensing By Infineon Technologies  06.05.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency By MRPeasy   06.02.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC By Menta  06.02.2025 One has to remember that Chips Acts should be viewed as part of a broader industrial policy . In talking to one CEO of a U.S.-based company this week, who agreed to be interviewed under anonymity, I learned he has spent most of his time this year in Taiwan because that is where the lion’s share of the manufacturing ecosystem and directly connected value chain is, and it was important to build these partnerships in order to scale up. Taiwan has spent years nurturing this ecosystem and it has worked well so far. In Europe, we reported in EE Times Europe on the launch of Ireland’s national semiconductor strategy, which dovetails into the EU Chips Act. What is interesting about Ireland and it’s “Silicon Island” ambition is that it already has a strong semiconductor base with over 130 indigenous and multinational companies, 20,000 jobs and €13.5 billion (about $15.4 billion) in annual exports. “With the right support, I believe we could do far more. By 2040, Ireland could support up to 34,500 new semiconductor roles,” said Peter Burke, Irish Minister for Enterprise, Tourism and Employment. “We have established I-C3—a national competence center under the European Chips Act—and joined forces with Analog Devices and 14 EU Member States in the IPCEI [Important Projects of Common European Interest] on microelectronics.” The Silicon Island story highlights the importance of ecosystem, as Giorgos Fagas, director of strategic development at Tyndall National Institute , observed at the launch of Silicon Island. “Today, we have a mix of big multinational companies, such as Qualcomm, but we also have companies like Cadence that support the whole semiconductor value chain in Ireland. One of the most essential things is growing our end-to-end ecosystem across the semiconductor supply chain. And when that is connected and brought together, it gives space for the homegrown SMEs to operate. This is something we experience at Tyndall, for example. Our spinouts tend to stick around for quite some time and grow, like Firecomms, but also, in many cases, are bought by big companies like InfiniLed, which was acquired by Oculus and is now part of Meta. We also see a full pipeline of startups and homegrown organizations in addition to those SMEs or startups from elsewhere that wish to grow in Ireland.” (Read the full story, “Ireland Maps Out ‘Silicon Island’ National Semiconductor Strategy” at EE Times Europe here .) Tariffs The other big ongoing topic is tariffs. This week, in an exclusive EE Times interview , Jim Keller, CEO of Tenstorrent, said, “I don’t think it does the U.S. any good to [regulate exports of AI technology].” He noted that export controls on semiconductor manufacturing equipment have meant China has doubled down on developing this technology internally. “As best as I can tell, in the last five years of regulation of semiconductor equipment into China, that’s sped China up about five years,” he added. Indeed, we also reported on the U.S. Department of Commerce inquiry on the national national-security impact of imports of chips and semiconductor manufacturing equipment (SME) and their derivative products under Section 232 of the Trade Expansion Act of 1962, in which leading chipmakers building new fabs in the U.S. warned the administration of U.S. President Donald Trump against levying new tariffs potentially halting a surge in construction that is driving a return of the domestic industry and weakening American tech leadership. Despite this, we still saw an announcement this week from GlobalFoundries, pledging to invest $16 billion in the U.S. to expand chipmaking and advanced packaging, notably with endorsement from customers Apple, AMD and Qualcomm. In other news In other news this week, SEMI reported in its Worldwide Semiconductor Equipment Market Statistics (WWSEMS) Report that global semiconductor equipment billings increased 21% year-over-year to $32.05 billion in the first quarter of 2025. “The global semiconductor equipment market began 2025 with a solid quarter that reflects future-looking investments in vital chipmaking capacity across regions,” said Ajit Manocha, SEMI President and CEO. “With the ongoing AI boom continuing to drive fab expansions and equipment sales, the industry is showing resilience in the face of uncertainty around geopolitical tensions, tariff volatility and export controls.” The first quarter of 2025 saw 21% year-over-year increase in global semiconductor equipment billings. (Source: SEMI) ROHM announced what it claims is a breakthrough in AI-equipped MCUs , with the first MCU capable of predicting equipment anomalies via on-device learning and inference without a network. Broadcom said it is now shipping the Tomahawk 6 switch series, delivering what it claims is the world’s first 102.4 Terabits/sec of switching capacity in a single chip—double the bandwidth of any Ethernet switch currently available on the market. SiliconLabs and Wirepas announced they have shipped 10 million wireless SoCs running Wirepas’ RF mesh connectivity software, primarily in the Indian market. In December 2024, the two companies said four million smart electric meters using Wirepas Mesh software had been deployed in India built on the sub-GHz FG13 and FG23 platforms, helping the country meet the goals of its Advanced Metering Initiative . That is all for now—I hope to catch people next week (week of June 9th) in London, U.K. for London Tech Week , and in Porto, Portugal, for the MES & Industry 4.0 International Summit . RELATED TOPICS: SEMICONDUCTORS , SOC Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Nitin Dahad Nitin Dahad is editor-in-chief of EE Times. An electronic engineering graduate from City University, he’s been an engineer, journalist and entrepreneur. He was part of ARC International’s startup team and took it public, and he co-founded a publication called The Chilli in the early 2000s. Nitin has also worked with National Semiconductor, GEC Plessey Semiconductors, Dialog Semiconductor, Marconi Instruments, Coresonic, Center for Integrated Photonics, IDENT Technology and Jennic. Nitin also held a role with government promoting U.K. technology globally in the U.S., Brazil, Middle East and Africa, and India. Follow Nitin on LinkedIn 0 comments Post Comment Leave a Reply Cancel reply You must Register or Login to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed ."
  },
  {
    "title": "China Weaponizes Rare Earths, Hitting Factories",
    "source": "EE Times",
    "date": "2025-06-06",
    "link": "https://www.eetimes.com/china-weaponizes-rare-earths-hitting-factories/",
    "text": "design Lines Automotive Designline China Weaponizes Rare Earths, Hitting Factories Beijing leverages its rare earth dominance as economic leverage, disrupting global manufacturing By Pablo Valerio 06.06.2025 0 Share Post Share on Facebook Share on Twitter China commands the global supply chain for rare earths (REEs), controlling the extraction and, critically, the intricate processing and manufacturing of key components like high-performance magnets. The current market conditions remind SNAFU －a WWII American military slang that stands for “situation normal, all fucked up.” Taiwan controls the production of advanced semiconductors, but China controls the materials for advanced electronics. Rare Earth Elements (REEs), a group of 17 chemically similar metallic elements, are fundamental to a vast spectrum of modern technologies. They are critical for their unique magnetic, catalytic, and luminescent properties. Source: International Energy Agency (IEA) Governments and companies in the United States and Europe have been complaining for years about the concentration of high-tech manufacturing in Asia, especially semiconductors in Taiwan, memory in South Korea and China, and final assembly in different Asian countries. The situation is much more adverse with the Chinese control of critical minerals. Partner Content View All The Opportunity for Liquid Sensing By Infineon Technologies  06.05.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency By MRPeasy   06.02.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC By Menta  06.02.2025 This overwhelming dominance, resulting from decades of deliberate, state-led industrial policy, is now being leveraged as a potent tool of economic statecraft, posing significant threats to manufacturers in the United States, Europe, and beyond. China’s strategic advantage is in the midstream processing stages. According to the U.S. Geological Survey, while the country produces over 60% of global REE output , its control over refining capacity is at a staggering 90%. Source: IEA and U.S. Geological Survey It includes a “de facto monopoly on 100% of heavy rare earths (HREEs) processing.” HREEs, like dysprosium and terbium, are vital for permanent magnets in demanding applications, from electric vehicle motors to advanced defense systems. China has also extended its control downstream, accounting for an overwhelming 92% of the world’s production of neodymium-iron-boron (NdFeB) permanent magnets as of 2019. This strategic focus has led to the “hollowing out” of processing and magnet manufacturing capabilities in many Western nations. Export controls to weaponize dependence The long-cultivated dominance is now actively deployed in the context of intensifying geopolitical rivalry. On April 4, 2025, Beijing imposed new export controls and a stringent licensing system on specific medium, heavy rare earths, and several rare earth magnets. Officially, China cited national security and non-proliferation concerns. However, just two days after new U.S. tariffs were announced, the timing strongly suggests the measures are a retaliatory action against escalating U.S. trade and technology restrictions, particularly those targeting Chinese tech firms. The export licensing system itself serves as more than just a control mechanism. It requires detailed information about the end-user and specific end-use, effectively serving as an intelligence-gathering tool that allows Beijing to map foreign dependencies and potentially exploit vulnerabilities. Adam Dunnett of the EU Chamber of Commerce in China reported that “some applicants are asked for sensitive information that might compromise their intellectual property” to secure a license. Adding to the pressure, China has intensified crackdowns on REE smuggling , ensuring the formal licensing system is the only export channel. As a joint statement from the Ministry of Commerce put it, “Strategic mineral export control is related to national security and development interests, and strengthening the control of the entire export chain is the key.” Production lines already affected The consequences of these controls have been swift and severe across Western industries. Automakers are particularly vulnerable due to their reliance on REE magnets for electric vehicles. Ford Motor Company had to halt production of its Explorer model at its Chicago plant for a week in May due to a rare-earth shortage. Toyota experienced similar disruptions, pausing hybrid production at a Kentucky facility for three days. The situation is equally dire in Europe. The European Association of Automotive Suppliers reported that several European production lines and plants had already closed by early June. “Although some licenses have now been granted, this is currently not enough to ensure smooth production. If the situation does not change quickly, production delays and even production outages can no longer be ruled out,” warned Hildegard Müller , head of the German Association of the Automotive Industry. Some European companies already had to “stop production” altogether. Within two weeks of the restrictions, 32% of EU manufacturers reported critical shortages. Shifting supply chains The restrictions on magnets, not finished parts, are even prompting some manufacturers to consider the paradoxical move of shifting parts of their production to China to have magnets installed there. “If you want to export a magnet [from China], they won’t let you do that. If you can demonstrate that the magnet is in a motor in China, you can do that,” noted a supply-chain manager at one carmaker. Defense sectors are also acutely exposed. REEs are critical for advanced military hardware, including F-35 jets, nuclear submarines, and missile systems. Controls on HREEs could delay weapons production by six to eight months, with one assessment stating, “We are one supply chain disruption away from grounding entire fleets.” If the supply of magnets declines, analysts estimate F-35 production could fall by 40%. The controls have also triggered sharp price increases, with dysprosium, essential for heat-proofing the electric motors on the F-35, climbing 30% in April 2025 and European procurement costs for NdFeB magnets increasing 22% week-over-week, highlighting the inherent fragility of current supply chains. Several sources Uphill battle for suitable alternatives Establishing alternative REE supply chains outside of China faces significant and enduring challenges. Due to the elements’ similar chemical properties, the processing and refining of rare earths is notoriously difficult, requiring complex, multi-stage processes. China has gained decades of operational and technical expertise. The know-how for mining and processing is the rarest part of the supply chain, and China is the largest holder of it. Furthermore, on December 21, 2023, China announced a ban on rare earth extraction and separation technologies . Economically, building new REE projects is exceptionally expensive , with capital costs typically 50% higher than in China. A processing plant can cost around $1 billion. Furthermore, the market is experiencing extreme price volatility, often distorted by China’s state-led subsidies and policies that depress global prices. This makes non-Chinese projects economically challenging without significant government support. Environmental issues for new mines and processing Environmental challenges are also substantial. REE extraction and processing generate significant toxic waste, including radioactive residues. Western nations face much stricter environmental regulations and public opposition, leading to longer permitting timelines and higher costs for sustainable practices than China’s historical development. These factors contribute to lengthy timelines. Building new mines and processing facilities can take a decade or more. Despite accelerated efforts, projected output from new domestic production in countries like the U.S. remains a “mere fraction of China’s established capacity for the foreseeable future.” For example, MP Materials’ ambitious goal to produce 1,000 tons of NdFeB magnets annually by the end of 2025 pales compared to China’s estimated production of 300,000 tons in 2024. Analysts estimate Washington is still “a decade away from securing rare earth independently from Beijing.” China will not back down any time soon Despite the widespread impact, China appears unwilling to compromise on the core elements of its new control regime. U.S. officials have accused Beijing of “slow rolling” on a supposed agreement to lift restrictions. China, in turn, has alleged “ discriminatory and restrictive measures ” by Washington. The licensing system remains intact, and the anti-smuggling campaign reinforces Beijing’s control. As former Assistant Secretary of Commerce Nazak Nikakhtar explained , “This is America’s, and the world’s Achilles’ heel, which China continuously exploits.” Addressing this vulnerability requires a fundamental shift and sustained effort. Still, the entrenched nature of China’s control and the inherent difficulties of building alternatives means reducing dependency will be a long-term undertaking. RELATED TOPICS: MAGNETS , MANUFACTURING , RARE EARTH MATERIALS , SUPPLY CHAIN , U.S. - CHINA TRADE WAR Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Pablo Valerio Pablo is a seasoned engineer with 30+ years of experience. For over 10 years, he's been a contributing editor for EE Times (where he edits the Supply Chain section). He also wrote for EPSNews, InformationWeek, EBN, LightReading, Network Computing, and IEEE Xplore. His coverage spans Supply Chain, Semiconductors, Networks, IoT, Security, and Smart Cities. He holds an MEng, Electrical and Electronics Engineering from The Ohio State University. Follow Pablo on LinkedIn 0 comments Post Comment Leave a Reply Cancel reply You must Register or Login to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed ."
  },
  {
    "title": "Gadget Book: Practical Deep Learning (with Python)",
    "source": "Electronics Weekly",
    "date": "2025-06-06",
    "link": "https://www.electronicsweekly.com/blogs/gadget-master/general/gadget-book-practical-deep-learning-with-python-2025-06/",
    "text": "Gadget Book: Practical Deep Learning (with Python) This book may be of interest to Gadget Masters getting serious with the use of AI and looking to develop their own learning model. It's called Practical Deep Learning. Or Practical Deep Learning (2nd Edition), A Python-Based Introduction as its more formally known. As the full title indicates, Python is…"
  },
  {
    "title": "Vehicle hardware security certified to ISO/SAE 21434",
    "source": "Electronics Weekly",
    "date": "2025-06-06",
    "link": "https://www.electronicsweekly.com/news/products/software-products/vehicle-hardware-security-certified-to-iso-sae-21434-2025-06/",
    "text": "Vehicle hardware security certified to ISO/SAE 21434 Software company Vector has gained ISO/SAE 21434 certification for its vehicle hardware security modules firmware. ISO/SAE 21434 sets cybersecurity risk limits for road vehicles throughout their life cycle. The firmware is called Microsar HSM, and it was certified using Infineon Aurix TC3xx MCUs, which have Infineon’s proprietary TriCore cores. “The ISO/SAE 21434 certification of Microsar HSM confirms the use of state-of-the-art processes in automotive cybersecurity,” claimed the company. “This certification also helps meet the requirements of the supply chain for type approval of vehicles worldwide. In addition Vector now offers product-specific certification in accordance with ISO/SAE 21434 to support the implementation of UN Regulation 155.” Hardware security modules within vehicle ECUs (electronics control units) protect against unauthorised access and manipulation. The newly certified firmware accesses available security hardware resources to provide cryptographic functions, secure key memory and secure boot. MAC (message authentication code) is offered to enhance on-board network security, and TLS (transport layer security) protocol is available for off-car communication protection. Pre-configured evaluation bundles for the firmware are available for Infineon TC37x (secure gateway / tasking compiler) or TC397x (tasking compiler), Renesas RH850 F1KM or RH850 U2A (both GreenHills compiler, or Taxas Instruments JACINTO7 (TI compiler). Microsar HSM can be found on this Vector web page , and the certificate can be downloaded from test house Exida here Late last year, Vector teamed up with development tool company PLS to created a timing analysis bundle for Microsar Classic , the functional code that Vectors pairs with Microsar HSM. In conversaation with: Margaret Schmitt Windows or Linux? A safe choice AWS Summit: Cloud-based software-defined vehicle design End-to-end secured programming for MCUs at third parties cybersecurity vehicle 2025-06-06 Steve Bush tweet"
  },
  {
    "title": "DigiKey offers Zephyr RTOS workshop, video training",
    "source": "Electronics Weekly",
    "date": "2025-06-06",
    "link": "https://www.electronicsweekly.com/news/business/distribution/digikey-offers-zephyr-rtos-workshop-video-training-2025-06/",
    "text": "DigiKey offers Zephyr RTOS workshop, video training DigiKey is providing a free, on-demand Zephyr RTOS online workshop and video series. Aimed at students and engineers, you learn how to write a Zephyr device driver. Zephyr is real-time operating system (RTOS) and development framework, an open source project at the Linux Foundation. DigiKey identifies a steep learning curve, but says Zephyr is a key system for engineers and students to learn. David Sandys, senior director and technical marketing for DigiKey, commented: “DigiKey is proud to help educate the next generation of engineers in some of the more complex topics that don’t get a lot of attention. This type of training is unique and a valuable resource for anyone hoping to further their understanding of the Zephyr operating system.” As mentioned, the workshop is available on-demand. And an accompanying educational video series is available on YouTube. Zephyr RTOS Arduino and Ambiq are among other companies recently turning attention to using the Zephyr RTOS. Arduino, for example, has described the RTOS in the following terms: “Zephyr is an open source project at the Linux Foundation that builds a secure, connected and flexible RTOS for future-proof and resource-constrained devices, is easy to deploy and manage. It is a proven RTOS ecosystem created by developers for developers.” Arduino was transitioning away from using ARM’s Mbed IoT platform to Zephyr instead. Arduino was responding to Arm retiring Mbed. Its end of life is officially July 2026 and so it will no longer be maintained. Arduino’s use of the platform ranges from browser-based IDEs and hardware abstraction to code hosting and remote build services, it said. The Arduino team joined the Zephyr project, as Silver Members, back in 2023. Alternative systems to Zephyr could include the open source NuttX from Apache, or RT-Thread. With WindRiver’s VxWorks a proprietary equivalent. Speaker In the 1.5 hour workshop , Shawn Hymel (right) – a specialist in Embedded Systems and Machine Learning – will write an I2C temperature sensor device driver for Zephyr. Viewers will get experience working with C code, CMake, Kconfig, and the Devicetree. The first video in the YouTube series is below. See also : Percepio supports Zephyr and Microsoft Azure ThreadX DigiKey introduces own-brand DigiKey Standard product line DigiKey premieres Sustainable Futures video series Untangling tariffs DigiKey, SparkFun partner for STEM with XRP Robotics Kits Digikey RTOS 2025-06-06 Alun Williams tweet"
  },
  {
    "title": "Genesis of European semi manufacturing  clean-up",
    "source": "Electronics Weekly",
    "date": "2025-06-06",
    "link": "https://www.electronicsweekly.com/news/business/genesis-of-european-semi-manufacturing-clean-up-2025-06/",
    "text": "Genesis of European semi manufacturing  clean-up With a budget of close to €55m, European chip makers have set out to reduce waste, pollution and energy consumption throughout their supply chain. 58 partners, including large companies, SMEs, research institutes, universities and industry associations, will spend three yeas on a project named Genesis, aligned with the European Green Deal and European Chips Act, and coordinated by French research lab CEA-Leti. “Genesis is designed to address the complex challenges of building a truly sustainable semiconductor ecosystem,” said and Leti sustainable electronics program director Laurent Pain. “Its structure reflects both the urgency and the opportunity of Europe’s green transition, powered by the expertise and collaboration of its partners.” Genesis’ genesis – partner representatives kick off the programme It has four pillars: Monitoring and sensing: Real-time emissions tracking, traceability and process feed-back systems New materials: PFAS-free chemistries and low-GWP alternatives Waste minimisation: Recycling and reusing solvent, gasses and slurries, and finding sustainable replacements Critical raw materials mitigation: Strategies to reduce dependency on these, and to strengthen resource security Alongside these pillars, an overall framework will be established to deploying sensor-integrated abatement systems to reduce PFAS and GHG emissions. “It also aims to position Europe as a leader in green semiconductor innovation by aligning supply-chain practices with environmental regulations,” according to Leti. Around 45 necessary innovation have so far been identified, said project manger Pain. Fraunhofer Institute for Photonic Microsystems is a partner, assigned to minimise chemical waste, including tackling the PFSAs (perfluorinated and polyfluorinated alkyls) mentioned above, as well as focussing on emissions of persistent greenhouse gasses. “We are concentrating on replacing and reducing the emission of climate-damaging gases such as SF 6 or NF 3 . These gases are 10,000 times more harmful than CO 2 , but are needed in the semiconductor industry,” said Fraunhofer IPMS project lead Erik Schumann. “We are also working to reduce the waste produced during chemical mechanical polishing.” European Commission funding for Genesis is being channelled through Chips Joint Undertaking (Chips JU) – a public-private partnership created to foster collaboration between the EU, its member states and the semiconductor private sector. “As chips become the backbone of everything from AI to energy systems, their environmental footprint is rapidly growing,” said Chips JU head of programmes Anton Chichkov. “The launch of the Genesis project marks a critical step toward aligning Europe’s semiconductor ambitions with its climate commitments. Through this initiative, Europe is not only investing in cleaner technologies, it is positioning itself as a global leader in green semiconductor manufacturing.” Alongside EC/Chips JU funds are also coming from participating EU member states and SERI, the Swiss State Secretariat for Education, Research and Innovation. Find the Genesis website here Rare earths export restrictions hit car production Imec researchers demo single-chip optical and microwave integration Robots to enable urban mining of CRMs 42 Technology moves to Cambourne Park for more space and high-tech neighbours 2025-06-06 Steve Bush tweet"
  },
  {
    "title": "Most Read – STEP for Semiconductor, Tomahawk 6, Stacked DRAM",
    "source": "Electronics Weekly",
    "date": "2025-06-06",
    "link": "https://www.electronicsweekly.com/blogs/electro-ramblings/latest-news/most-read-step-for-semiconductor-tomahawk-6-stacked-dram-2025-06/",
    "text": "Most Read – STEP for Semiconductor, Tomahawk 6, Stacked DRAM For those written in the last week, our most read stories on the site cover Alliance Memory products, Soitec collaborating with Powerchip, the UKESF launching the Semiconductor STEP programme, Broadcom’s Tomahawk 6, and Intel developing a stacked DRAM alternative to HBM… Let’s take them in reverse order, as always, according to Google Analytics… 5. Anglia signs Alliance for legacy memory Anglia Components sign an agreement to support and supply the full range of legacy and new memory products, including SRAM, DRAM and Flash, manufactured by Alliance Memory. The Alliance products are pin-for-pin drop-in replacements for devices originally supplied by Micron, Samsung, Infineon/Cypress, Macronix, ISSI, Nanya, Hynix, and others. “Alliance Memory’s competitive pricing, multi-source supply strategy and secure inventory management strategies have made the company a trusted source for a growing range of memory ICs,” says Anglia’s John Bowman 4. Soitec and PSMC hook up for TLT wafers Soitec, the French wafer manufacturer, announces a strategic collaboration with Powerchip Semiconductor Manufacturing Corporation (PSMC). Soitec will supply PSMC 300mm substrates incorporating a release layer, Transistor Layer Transfer (TLT) ready, to support a new demonstration of advanced 3D chip stacking at the wafer level. This marks the first public announcement of Soitec’s TLT technology. The technology is an enabler for next-gen semiconductor designs, with potential applications ranging from smartphones, tablets and AI devices to autonomous driving. 3. UKESF takes first STEP for Semiconductor: Skills, Talent and Education Programme A UK government initiative, with funding of £4.75m, sees the UK Electronics Skills Foundation (UKESF) launching the Semiconductor STEP programme (Skills, Talent and Education Programme). With demand for semiconductor skills vastly outstripping supply, the goal is to help tackle the skills shortage in the UK’s semiconductor sector. Effectively, building a pipeline of skills and enabling more young people to have careers in electronics engineering careers. This is where the UKESF – an educational charity – becomes the facilitator. 2. Broadcom shipping Tomahawk 6 Broadcom is now shipping the Tomahawk 6 switch series, delivering 102.4 Terabits/sec of switching capacity in a single chip which is claimed to be double the bandwidth of any Ethernet switch on the market. Tomahawk 6 is built to power AI networks, delivering support for 100G/200G SerDes and co-packaged optics (CPO). It offers a set of AI routing features and interconnect options for AI clusters with more than one million XPUs. The Tomahawk 6 family includes an option for 1,024 100G SerDes on a single chip. 1. Intel and Softbank explore alternative to HBM A new company set up by SoftBank and Intel, is developing a stacked DRAM alternative to HBM which uses half the power of HBM, reports the Nikkei. A prototype is two years away and production is expected by the end of the decade. The initial technology came from Intel, Tokyo University and other Japanese academic sources. The project is expected to cost $70 million. Softbank is putting up $21 million. The Riken research institute and Shinko Electric are considering contributing investment or technological collaboration. Most Read – China and ASML, Intel’s 18A, IBM closing R&D What caught your eye this week? (Laptop GPUs, Supply Chain, Apple) Most Read articles – Semi sales, NovoSat antenna, Battery life Anglia Components broadcom UKESF 2025-06-06 Alun Williams tweet"
  },
  {
    "title": "Rare earths export restrictions hit car production",
    "source": "Electronics Weekly",
    "date": "2025-06-06",
    "link": "https://www.electronicsweekly.com/news/business/rare-earths-export-restrictions-hit-car-production-2025-06/",
    "text": "Rare earths export restrictions hit car production China’s rare earths export ban is to beginning to affect car production, reports the Nikkei. Suzuki has suspended production of its Swift models. Ford has suspended production of its Explorer sports SUV at its Chicago factory. The European Association of Automotive Suppliers (CLEPA) says some auto component makers have been forced to close plants. India’s Bajaj Auto said the magnet shortage could start impacting production in July. There are reports that other Indian car manufacturers – India is the world’s fourth biggest carmaker – will have to stop production soon because of a lack of rare earths. Indian car makers are reported to have made 20 applications to China for licences to export rare earths to India but none have been approved so far. Stocks of rare earths at car makers in India are said to vary from three to six weeks so the problems could quickly get worse. GMSL automotive bus gets an industry association as ‘OpenGMSL’ Q1 NEV sales up 39% y-oy Foxconn and Mitsubishi hook up on EVs PCIM: Cissoid and Edag team for SiC traction inverter Automotive rare-earth 2025-06-06 David Manners tweet"
  },
  {
    "title": "Imec researchers demo single-chip optical and microwave integration",
    "source": "Electronics Weekly",
    "date": "2025-06-06",
    "link": "https://www.electronicsweekly.com/news/business/imec-and-ghent-uni-2025-06/",
    "text": "Imec researchers demo single-chip optical and microwave integration The Photonics Research Group and IDlab, two imec research  groups at Ghent University, and imec, have demo-ed a fully-integrated single-chip microwave photonics system, combining optical and microwave signal processing on a single chip. The chip integrates high-speed modulators, optical filters, photodetectors, as well as transfer-printed lasers, making it a compact, self-contained and programmable solution for high-frequency signal processing. This  can replace bulky and power-hungry components, enabling faster wireless networks, low-cost microwave sensing, and scalable deployment in applications like 5G/6G, satellite communications, and radar systems. Modern communication networks rely on both high-speed fiber-optic links and wireless radio-frequency microwave transmission, but as demand for higher data rates and operation at higher frequencies grows, new systems need much tighter integration between these two modes of communication to overcome the struggle with signal processing complexity, high transmission losses, and power-hungry electronics. Microwave photonics offers a promising solution by using optical technology to process high-frequency signals with lower loss, higher bandwidth, and improved energy efficiency. However, most microwave photonics systems rely on bulky, fiber-based architectures that limit scalability. In contrast integrating microwave photonics onto a chip could enable more scalable and power-efficient systems, but early experimental demonstrations have either lacked key functionalities or required external components to achieve full performance. Imec and Ghent University now demonstrate a silicon photonic engine that processes and converts both optical and microwave signals on a single chip. The key innovation in this new system lies in the novel combination of a reconfigurable modulator and a programmable optical filter enabling efficient modulation and filtering of microwave signals while significantly reducing signal loss. This  combination enhances overall performance allowing the system to handle complex signal processing tasks with greater flexibility and efficiency for a wide range of applications. The chip is built on imec’s standard iSiPP50G silicon photonics platform, which includes low-loss waveguides and passive components, high-speed modulators and detectors, and thermo-optic phase shifters for tuning the optical response. To provide an integrated light source, the researchers incorporated an indium phosphide (InP) optical amplifier (developed by III-V Lab) on the chip using the microtransfer-printing technology developed at the Photonics Research Group (imec/Ghent University). In combination with on-chip tunable filter circuits, this allows the optical amplifier to function as a widely tunable laser, further enhancing the system’s versatility. “The ability to integrate all essential microwave photonics components on a single chip marks a major step toward scalable and energy-efficient high-frequency signal processing,” saida, professor in the Photonics Research Group at Ghent University and imec. “By eliminating bulky external components, this technology paves the way for more compact, cost-effective solutions in next-generation wireless networks and advanced sensing systems.” Imec fabs Ru lines at 16nm pitch with low resistance Luc Van den hove proposes reconfigurable AI ICs Imec co-ordinates 12 EU chip design partners Imec shows photonics-enabled CDM FMCW 144FH radar IMEC 2025-06-06 David Manners tweet"
  },
  {
    "title": "Robots to enable urban mining of CRMs",
    "source": "Electronics Weekly",
    "date": "2025-06-06",
    "link": "https://www.electronicsweekly.com/news/business/robots-to-enable-urban-mining-of-crns-2025-06/",
    "text": "Robots to enable urban mining of CRMs Critical Raw Materials (CRMs) are essential for sustainable technology, yet Europe depends heavily on a few remote primary sources, leaving the supply chain exposed to disruptions. With a current recycling rate of less than 1% for rare earth elements and a Waste from Electric and Electronic Equipment (WEEE) collection rate of just 40.6%, well below the 65% target, urban mining presents a promising alternative and complementary source of critical raw materials. To address this opportunity, iBot4CRMs is developing integrated AI-powered robotic systems designed to maximise the recovery and recycling of critical raw materials like neodymium magnets, copper, gold, and silver from urban waste. The project will demonstrate how integrating AI, data analytics, and robotics can enhance recycling processes for Urban Waste, Incineration Slag, Metal Scraps, Waste Electrical and Electronic Equipment (WEEE), and Electric Vehicles (EVs). It will do so through seven validation scenarios carried out at four large-scale pilot sites in Turkey, Greece, Spain, and Portugal. This approach not only enables real-world validation but also paves the way for a cost-effective business strategy for large-scale deployment. Critical raw materials are especially important as they enable many modern and future sustainable technologies that drive the decarbonisation of our value chains. By strengthening Europe’s resilience and competitiveness in the supply of CRMs, this project aims to address the challenges  outlined in the Critical Raw Materials Act and the European Green Deal. IBot4CRMs brings together 18 partner organisations from across Europe. The multidisciplinary nature of the consortium is one of its strengths, combining providers of state-of-the-art technology and sensors with active and innovative players in the recovery of valuable materials and recycling in real commercial use cases. Led by the NORCE, the 4-year Horizon Europe Innovation project kicked off with an initial gathering in Kristiansand, Norway, in January 2024. Q5D adds its largest wire harness automation robot Humanoid robots to be $4bn market by 2028 Humanoid robots poised for the mass market Melexis magnetism helps assemble robotic joints Robotics 2025-06-06 David Manners tweet"
  },
  {
    "title": "European SPACE4Cities names 20 winning urban planning projects",
    "source": "Electronics Weekly",
    "date": "2025-06-06",
    "link": "https://www.electronicsweekly.com/news/european-space4cities-names-20-winning-urban-planning-projects-2025-06/",
    "text": "European SPACE4Cities names 20 winning urban planning projects The European-funded SPACE4Cities initiative has selected 20 innovative projects for its €2.8 million competition winners. The winning systems focus on using satellite data to support urban planning and tackle challenges in both climate adaptation and sustainable mobility. Basically, the smart use of European satellite data for the better management of public spaces. Each of the 20 winners will receive up to €36,000 of funding to create a detailed Solution Design. And funding will increase as the final five are selected SPACE4Cities Funding for SPACE4Cities is from the EU Agency for the Space Programme (EUSPA). And it says it received 141 proposals from across 23 European countries. “We were surprised and delighted by the huge interest in our competition, the space-based solutions, and this record number of tenders for us”, said the SPACE4Cities Project Coordinator, Renske Martijnse-Hartikka of Forum Virium Helsinki. “We are happy to say, the level of innovation is high, and there is a large enthusiasm from the companies to start refining their solutions with us.” Winners The 20 winners come from eleven countries, including three from Belgium, France and the Netherlands. There are two from Finland, Italy and Spain, and one from Austria, Czech Republic, Greece, Hungary and Portugal. According to the organisers 85% of the winners are small or medium sized companies (under 250 employees). In terms of subject area splits, thirteen of them address the Urban Planning challenge. And eleven focus on Climate Adaptation, and four on Sustainable Mobility. The full list of winning companies comprise: ASITIS (Czech Republic), Avoin Map (Finland), BitaGreen (Belgium), CEiiA (Portugal), CGI Nederland (Netherlands), Detektia (Spain), eOnsight (France), Everimpact (France), Geo Solutions (Belgium), GeoVille (Austria), Latitudo 40 (Italy), Neptune (Italy), OPTIM.AIZE (France), ORG Urbanism & Architecture (Belgium), Paulinyi&Partners Innovations (Hungary), Sensar (Netherlands), SINGULARLOGIC (Greece), Survintel (Netherlands), Vexiza (Spain) and Zero Gravity (Finland). Phases As mentioned, each company will create a Solution Design. After August 2025, the ten most suitable systems will advance to the next phase. This will involve a further €90,000 each of funding for each. They will develop their concepts into working prototypes, by the end of April 2026. Finally, the best five will then have the opportunity to field-test their prototypes in three different European cities during July 2026 – February 2027. They will also receive an award of up to €250,000 each, taking their funding up to €376,000 each. The cities taking part for the final tests will be Amsterdam, Athens, Ghent, Guimaraes, and Helsinki. You can read more about the urban planning inititative on its dedicated website. Image: SPACE4Cities See also : UK Space Agency funds satellite instruments to monitor emissions Biomass satellite mapping Earth’s forests in 3D with P-band SAR data Blue Skies Space wins contract to map signals from cosmic dark ages Northrop Grumman, Intelsat complete historic satellite life-extension mission Axelspace to boost Earth observation microsatellite constellation EU Satellites 2025-06-06 Alun Williams tweet"
  },
  {
    "title": "Intel’s Tech Predictions In 2009",
    "source": "Electronics Weekly",
    "date": "2025-06-06",
    "link": "https://www.electronicsweekly.com/blogs/mannerisms/yarns/intels-tech-predictions-in-2009-2-2025-06/",
    "text": "Intel’s Tech Predictions In 2009 16 years ago, Steve Cutler, Intel’s technical marketing manager, cane up with these ten predictions for the technology industry: Prediction One – new classes of portable devices with ten times more battery life Sub-threshold integrated circuit technology requires only 300mV to operate. Intel showed 4-way SIMD (single instruction multiple data) vector processing accelerator in 45nm in CMOS operated below its gate threshold voltage at the ISSCC technology conference. “This will lead to new classes of portable devices designed to take advantage of greater battery life, which in turn will drive popularity and uptake.” Prediction two – low-cost silicon photonics for faster, more reliable data transmission Silicon photonics optics channels will be used inside and outside PCs. For example, remote optical memory can be used to create converged I/Os so a PC could have a single unified connector for a computer display, LAN, printer, wireless connection, scanner, USB and so on. Furthermore, because an optical channel does not require design engineering to ensure speed – its inherent in its nature – speed is implicit which has all sorts of positive implications such as true HD down loads, storage capability and terabit networking. Prediction three – new heights of realism in visual computing There will be a shift from dedicated hardware graphics engines to genera l hardware running dedicated software as this has greater flexibility so features such as shadow map algorithms – an aspect of rendering that creates tiny ragged outline edges – can be replaced by ‘soft shadows’. ‘Order independent transparency’ – the ability to create overlaid images which are clearly transparent, will be vastly improved. Overall, these benefits will deliver new heights of realism to computer generated imagery. Immediate applications areas are gaming sphere, but it will also have implications for business applications and the film industry. Prediction four – realistic computer generated images Some types of complex graphic rendering requires the use of data sharing between the CPU and the graphic processing unit (GPU). However, the hardware-based model for graphics does not easily facilitate this at present. The sharing of virtualised memory between the CPU and the GPU will deliver the highest performance yet, for what are typically very complicated interactions. For example, complex data structures can be shared between the two with applications easily split between the CPU and GPU. Prediction five – malware will become a thing of the past Malware, whatever form it takes whether viruses, trojans or worms, will be beaten by hardware-based techniques that protect at the deepest level. Today Intel has ‘trusted execution technology’ which is a set of processor hardware extensions and chipsets that have security characteristics such as measured launch and protected execution. It achieves this by creating an environment in which applications can run within their own space, protected from all other software on the system. To a degree, the success of hardware-based security is also dependent on how much effort vendors are prepared to put into securing their products. But once it is known that there is a solution that successfully addresses the problem of malware market forces will drive vendors in this direction. Prediction six – personal internet devices will be truly personal Mobile internet devices (Mids) are already powerful enough to be useful and the introduction of sub-threshold devices (prediction one) mean these will run all day. Add this to a continuous Internet connection and users will, for example, be able translate words into other languages and hear then pronounced, or with GPS get a constant geographically-based pollen prediction for that day. Ten years from now Mids will be ubiquitous and application developers will flood the market with all sorts of ingenious ideas. Prediction seven – interactive computing devices make ‘composable computing’ a reality ‘Composable computing’ is the impromptu assembly of a logical computer from wireless components that are nearby – enabled by wireless links, automatically assembling networks, and simple graphical user interfaces that allow available components selected and connected as the user desires. For example, images taken on a mobile device could be directed onto a nearby TV, or the music playing on an MP3 player could be sent to a HiFi in the room. Prediction eight – next-generation TV will not be about pixels There is a limit to how big a TV screen can be without needing larger rooms, and a limit to the amount of resolution this size of screen needs. Beyond this, TVs will have to differentiate themselves by delivering further information. For example, click on a athlete in a running race to bring up biographical details in a window. Viewing will be from any location, delivered through various means such as ‘over-the-air’ and multi-cast IP, and available on a wide range of devices from notebook PCs to mobile internet devices and smart phones. Prediction nine – seamlessly connected 3-D worlds 3D worlds, perhaps the World of Warcraft and Second Life, will overlap and be used for more practical activities. Companies already get feedback from virtual users about new products before they are brought to the real market, and virtual spaces can be created as meeting places where employees can exchange information regardless of geographical location. With the impending advances in computer graphics and growth in devices, how long will it be before a company like Amazon.com, for example, establishes a 3D presence with shopping aisles and book shelves that can be entered via virtual worlds such as Second Life? Prediction ten – and finally a spectrum revolution is looming Already many devices contain two or three wireless connectivity options and as television becomes more interactive this need will become more pressing. As things stand today, the spectrum is fragmented and fairly chaotic, parts are saturated, and parts almost empty. It’s unlikely that this will happen in a smooth manner, as many organisations will wish to maintain dominance of their spectrum segment. However, for example, as broadcast TV eventually concedes its position to interactive TV which is tailored to each user’s preferences, spectrum will eventually be freed up. The Future Of Process Developing EDA Point Tools Is Over When Arm became accepted Customer Service 2025-06-06 David Manners tweet"
  },
  {
    "title": "AI and the problem of misinformation",
    "source": "EDN Network",
    "date": "2025-06-06",
    "link": "https://www.edn.com/ai-and-the-problem-of-misinformation/",
    "text": "Advertisement How likely is it that an AI system will be trained on incorrect information? Please consider the following example. Thomas Edison achieved a lot of things during his lifetime, but now and then, he was off base. When Edison invited Nikola Tesla to see his new phonograph, and Tesla immediately saw room for improvements, Edison was enraged, and the two of them got into a lifelong feud. Edison’s conflict with George Westinghouse about DC versus AC for public electric power systems was another example where Edison went _______ (fill in the blank for yourself). I’ve read Edison biographies, which pointed out his strengths and his flaws, but those writings seem to have vanished from the internet. Writings today seem only to extol Edison almost as a deity. I once read that when Edison was trying to choose a material for the filament of his electric light bulb, he was focused on what we would today call low-resistivity materials. Those filaments either didn’t work at all or had very short operating lifetimes. When he was told of Georg Simon Ohm and the fact of Ohm’s Law, Edison spurned that input and announced instead that he was not going to be limited by “Ohm’s silly law.” Eventually, though, he went to the carbon filament with its high resistivity and succeeded. Ohm’s law led him to that success. Advertisement Somewhere in the past, I came across a written item to the above effect about Edison, although recently, my trying to find that reference has been an exercise in futility (that deity thing again). However, something did come up during my searches, which I found very disturbing indeed ( Figure 1 ). Advertisement Partner Content The Opportunity for Liquid Sensing 06.05.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC 06.02.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency 06.02.2025 Figure 1 Disturbing Google search results when trying to find a reference about Edison and his rejection of Ohm’s law. When I entered a search term of Edison’s supposed “silly law” remark into Google, some of the search results that came up were full of stuff that was just plain, flat out, totally, utterly, and completely WRONG! Please take a close look at the three images above and read them carefully. They are denials of the validity and applicability of Ohm’s Law. Vital concepts, as rudimentary as static resistance versus dynamic resistance and thermal coefficients of resistance, are simply ignored. At one point, we read “… the light bulb is not ohmic and does not behave like a resistor.” The numerous mis-statements in these three screenshots are utterly appalling. Now, consider some AI system getting trained with the inclusion of the above. That AI system is going to be capable of producing erroneous results. It is going to be capable of “hallucinating” and anyone taking those results as valid will have been grievously misled. In spite of popular misconceptions and loads of public hype, AI doesn’t think. AI only regurgitates with formatting whatever can be found during its “training”. AI at its best is only an information retrieval tool, not a thinking entity with any level of judgment. Judgment still has to come from human brains. Scary, isn’t it? John Dunn is an electronics consultant, and a graduate of The Polytechnic Institute of Brooklyn (BSEE) and of New York University (MSEE). Related Content The real danger of artificial intelligence Is Generative AI Creating a New Three-Body Problem? AI vs. AI: Both Friend and Foe in Cybersecurity The Unchecked Specter of ‘Anti-Social’ Media 3 comments on “ AI and the problem of misinformation ” John Dunn June 6, 2025 For a still further disturbing AI concept, please see: https://licn.typepad.com/my_weblog/2024/02/an-alarming-ai-concept-john-dunn-consultant-ambertec-pe-pc.html Log in to Reply John Dunn June 6, 2025 A further look at using AI and getting things wrong: https://licn.typepad.com/my_weblog/2024/04/ai-hallucinations-john-dunn-consultant-ambertec-pe-pc.html Log in to Reply John Dunn June 6, 2025 Looking at what looks like AI but isn’t. https://licn.typepad.com/my_weblog/2023/02/ai-in-the-bathtub-john-dunn-consultant-ambertec-pe-pc.html Log in to Reply Leave a Reply Cancel reply You must Sign in or Register to post a comment."
  },
  {
    "title": "Standardization and modularization in pick and place equipment",
    "source": "EDN Network",
    "date": "2025-06-06",
    "link": "https://www.edn.com/standardization-and-modularization-in-pick-and-place-equipment/",
    "text": "Advertisement Pick and place equipment is instrumental in many facilities for raising overall output and reducing errors. However, electronics design engineers know that standardization and modularization are among the top requests from decision-makers who use or might soon use this equipment. Here’s how design professionals can address those standards in pick and place equipment. After failed efforts to standardize or modularize existing pick and place robots, people may think they should start from scratch to get things right. However, that is not necessarily the case if designers, engineers, and others involved with these projects focus on the most pressing issues and prioritize solving them. Advertisement That was the approach for a federal initiative working to improve the Department of Veterans Affairs prescription-fulfillment project. The initial aim was to use 20 modular units , each designed for a specific task. Advertisement Partner Content The Opportunity for Liquid Sensing 06.05.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC 06.02.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency 06.02.2025 However, those machines failed numerous tests, and the entity first involved in designing and installing them never finished the project. After assessing matters and implementing solutions, a robotics vendor improved the suction methods that allowed robots to pick up pills and installed funnels around each one to catch dropped pills. The vendor also implemented technology to train the system to recognize new pill types and shapes, making it future proof. This example shows how electronics design engineers, who identify the most significant issues and determine the best solutions, can get meaningful results and save time and money. Standard recommendations for training and maintenance Industrial decision-makers can lengthen the usefulness of pick and place equipment by keeping it well-maintained and ensuring operators know how to use it. These assets are similar to other specialty machines that need ongoing oversight to perform reliably. For example, many laser cutters have auto-focus features and real-time monitoring. Those capabilities tighten quality control but do not remove the need for supervision. Standardization occurs when managers create training processes, checklists, operator certifications, and other mechanisms to prevent costly mistakes. However, electronics design engineers can influence those resources by suggesting the content of the manuals, warranties, and materials people receive when purchasing pick and place machines. These engineers can also create guidelines about when to perform specific maintenance measures and stipulate the conditions that may require more frequent maintenance. Those insights can help people standardize internal processes to optimize their equipment. Traditional standardization opportunities come from purchasing equipment that meets specific industrial standards, such as those associated with pharmaceutical clean rooms. However, some companies purchase automated equipment from a single brand. Although that approach allows standardization, it limits future flexibility. For instance, recent microelectronics shortages have required creativity to fulfill industrial automation plans. Challenges like this mean standardizing industrial processes may be the best option. Pursue modularization to enable growth Electronics design engineers may work for clients who want specific pick and place integrations that address current needs while anticipating future requirements. In those cases, standardization may become limiting, but modularization could create the flexibility required to meet new needs as they emerge. S&S Activewear’s distribution center is a real-life application of that option. The company uses hundreds of autonomous mobile robots to bring items from shelves to workers. The upgrade saves the employees from time-consuming tasks, like walking up and down aisles to find the desired products. Executives also recognized how pick and place equipment fit into their automation goals. Although picking was once largely manual, specialty equipment has optimized the task and boosted productivity. The company now has 50 modular picker workstations , increasing its initial amount by over 50%. Workers do all their picking there after robots bring them the goods. Additionally, workers place all the picked goods directly into shippable cartons, shortening the process. This example shows the positive results that can happen when clients, designers, and other concerned parties focus on expansion potential from the beginning. Even if decision-makers are unsure how much their operations might grow, modular installations give them numerous options to implement later. Increase pick and place equipment adoption These suggestions can help electronics design engineers use their expertise and problem-solving strategies to encourage industrial leaders to bring pick and place machines into their facilities for the first time. The more decision-makers view automated equipment as aligned with their processes, the likelier they will be to use it. Ellie Gabel is a freelance writer as well as an associate editor at Revolutionized . Related Content Exploring the Future of Industrial Automation Different Sensor Technologies Behind Autonomous Mobile Robots Autonomous mobile robot (AMR) design revisited with AI algorithms Future of Manufacturing: How to Select Mobile Robots for Heavy Loads ‘Wi-Fi on Steroids’ Technology Allows Manufacturing Industry to Finally Cut the Cord 0 comments on “ Standardization and modularization in pick and place equipment ” Leave a Reply Cancel reply You must Sign in or Register to post a comment."
  },
  {
    "title": "GlobalFoundries Pledges $16 Billion U.S. Investment with Trump’s Help",
    "source": "EE Times",
    "date": "2025-06-05",
    "link": "https://www.eetimes.com/globalfoundries-pledges-16-billion-u-s-investment-with-trumps-help/",
    "text": "design Lines SoC Designline GlobalFoundries Pledges $16 Billion U.S. Investment with Trump’s Help By Alan Patterson 06.05.2025 0 Share Post Share on Facebook Share on Twitter GlobalFoundries has pledged to invest $16 billion in U.S. chipmaking with the endorsement of tech giants like Apple and SpaceX, as well as favor from U.S. President Donald Trump. The semiconductor manufacturer, ranked fifth in chip foundry sales, said in a June 4th statement that it has been working with the Trump Administration and gathering support from leading tech companies aiming to bring critical parts of their supply chain to U.S. shores. The New York-based company aims to expand chipmaking and advanced-packaging capabilities in the U.S. state and neighboring Vermont. GF said its investment is aimed at capturing “explosive growth” in AI, accelerating demand for new chips designed for power efficiency and high-bandwidth performance in data centers, communications infrastructure and AI-enabled devices. “At GlobalFoundries, we are proud to partner with pioneering technology leaders to manufacture their chips in the U.S.—advancing innovation while strengthening economic and supply-chain resiliency,” GlobalFoundries CEO Tim Breen said in the company’s statement.  “The AI revolution is driving strong, durable demand for GF’s technologies that enable tomorrow’s data centers, including GF’s leading silicon photonics , as well as GaN for power applications. At the edge, GF’s proprietary FDX technology is uniquely positioned to support AI functionality with low power consumption. With all these technologies and more manufactured right here in the U.S., GF is proud to play its part in accelerating America’s semiconductor leadership.” Partner Content View All The Opportunity for Liquid Sensing By Infineon Technologies  06.05.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency By MRPeasy   06.02.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC By Menta  06.02.2025 The announcement had the notable public endorsement of GF customers like Apple, AMD and Qualcomm. “GlobalFoundries has supplied semiconductors for Apple products since 2010, and we’re excited to see them expand right here in the U.S.,” Apple CEO Tim Cook said in GF’s statement. “These chips are an essential part of Apple products like iPhone, and they’re a powerful example of American manufacturing leadership.” SpaceX added its voice to the GF announcement. “We are excited by the expansion of GlobalFoundries’ manufacturing base right here in the U.S., which is core to Starlink’s growth and our commitment to manufacturing in the U.S., as well as our mission to deliver high-speed internet access to millions of people around the world,” said SpaceX COO Gwynne Shotwell. GF’s investment is a great example of the return of U.S. manufacturing for critical semiconductors, U.S. Secretary of Commerce Howard Lutnick said in the statement. “President Trump has made it a fundamental objective to bring semiconductor manufacturing home to America. Our partnership with GlobalFoundries will secure U.S. semiconductor foundry capacity and technology capabilities for future generations.” No timeline The $16 billion pledge has no timeline, however, and will still depend on market demand, according to Jeff Koch, an analyst with SemiAnalysis. “The amount is large in the context of annual capex for GlobalFoundries, which is typically in the neighborhood of $2 billion. But crucially, they did not specify a timeframe. Similar to the TSMC and Apple announcements of eye-popping capex commitments for the U.S., they mean much less when not time bound. GF’s customers are of course looking to secure their supply chain, but the only meaningful move towards onshore has been orders at TSMC Arizona ,” Koch said. “That was not a response to tariffs; it was planned well before. Most semiconductor companies have not materially changed their manufacturing plans in reaction to the tariff threats.” Others like TechInsights vice chair Dan Hutcheson differed, saying the GF move is more a geopolitical/tariff play than it is an AI one. “Many get the wrong idea about GlobalFoundries, thinking they don’t have an AI play because they don’t play at the Angstrom edge,” Hutcheson said, speaking of companies like TSMC and Samsung that make chips at the 2-nm node. “Widening the field-of-view from Angstrom tunnel-vision, there are big integration strategy shifts from simple scaling into chiplets, as well as away from copper to bringing photonics into the package with co-packaged optics,” he said. “There’s also the fact that the AI training is maturing while AI inference is just getting started. AI inference takes the market from the data center to the edge, where power consumption is far more important. These are all areas where GF has strength.” (Source: Counterpoint Technology Market Research) GF is strong in RF, automotive and low-power specialty devices, International Business Strategies CEO Handel Jones told EE Times. “With [a] high probability of tariffs of 20% or more for foundry wafers in specialty technologies, GF is making a smart decision,” Jones said. “Expect to see GF getting significant revenues from photonics in the future. Power management is also likely to be a growth area for GF and especially in data centers.” The Trump administration “clearly” encouraged GF to make the $16B investment by linking national-security needs, tariff barriers that equalize manufacturing cost in the U.S., recent alliances in the Middle East and the administration’s close attention to the corporate players, Hutcheson said. “While chipmakers fret about tariffs slowing market growth in the short-term, they have to make a strategic shift to take advantage of the new market dynamics that tariffs create over the long-term,” Hutcheson added. “With tariffs a key feature of the last three administrations, the high level of customer support GF got in putting this investment package together paints a clear picture that all of them plan to deal with this new economic landscape for the long term.” Endorsements from C-level executives at Apple, SpaceX, Qualcomm, NXP and GM were the big surprise in GF’s announcement, Hutcheson said. “This is extremely rare, and I doubt it’s ever happened before. All are GlobalFoundries’ customers and their public support of the investment points to them increasing their orders with GF.” Aiming for AI GF’s main AI-related business is inferencing applications. The company also provides essential nanometer-scale silicon around the Angstrom-node GPU cores made by TSMC that are used by Nvidia in servers. GF’s communications capability is a critical space that connects the data center to the outside world, Hutcheson said. “Here, GF’s 22FDX is essential for millimeter-wave communication as well as the company’s 45RFSOI for satellite ground terminal infrastructure. Millimeter wave is essential for auto, which needs low-latency communications for self-driving.” One key to success in the foundry business is not to compete directly with TSMC in areas where the top foundry dominates. “GF has been effective with this strategy to date,” Handel said. RELATED TOPICS: SEMICONDUCTORS , SOC Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Alan Patterson Alan has worked as an electronics journalist in Asia for most of his career. In addition to EE Times, he has been a reporter and an editor for Bloomberg News and Dow Jones Newswires. He has lived for more than 30 years in Hong Kong and Taipei and has covered tech companies in the greater China region during that time. Follow Alan on LinkedIn 0 comments Post Comment Leave a Reply Cancel reply You must Register or Login to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed ."
  },
  {
    "title": "Jim Keller: ‘Whatever Nvidia Does, We’ll Do The Opposite’",
    "source": "EE Times",
    "date": "2025-06-05",
    "link": "https://www.eetimes.com/jim-keller-whatever-nvidia-does-well-do-the-opposite/",
    "text": "design Lines AI & Big Data Designline Jim Keller: ‘Whatever Nvidia Does, We’ll Do The Opposite’ By Sally Ward-Foxton 06.05.2025 0 Share Post Share on Facebook Share on Twitter SANTA CLARA, Calif. — Fresh off the launch of the company’s Blackhole chip, Tenstorrent CEO Jim Keller is feeling happy. “I told my leadership team this is my best day at Tenstorrent in four years,” Keller told EE Times in an exclusive interview. “Our CPU team is kicking ass, we delivered the Beta drop for [RISC-V CPU IP core] Ascalon, our first training computer is up and running, we’re shipping Blackhole computers, and we just talked to this kid who’s building a compiler on top of our technology, who thinks what we’re doing is great.” Outside Keller’s office door in Santa Clara is a whiteboard on which he has written, “We’re going to win!” in big letters, alongside a tally of models currently running with “useful” levels of performance and reliability on Blackhole-generation hardware, which currently stands at five for the company’s TT-NN compiler stack. Another 15 models are “coming soon,” he said. The Forge team, building an MLIR compiler for the Tenstorrent stack, is further behind, but Keller said he has “hundreds” of engineers working on it. Partner Content View All The Opportunity for Liquid Sensing By Infineon Technologies  06.05.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency By MRPeasy   06.02.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC By Menta  06.02.2025 “MLIR is a really big win,” he said. “That was a really good choice, it felt great.” Contributing to MLIR, an open-source project, is something Keller is only too happy to embrace. Tenstorrent’s entire software stack is open-source; Keller said this has been a popular decision both inside and outside the company, even helping recruitment since the open-source ethos appeals to engineers. Tenstorrent’s software stack, in purple. TT-LLK is the environment for programming single tensor processors (writing kernels), TT-Metalium is the low level runtime that co-ordinates across many chips, TT-NN has the operation library and API, and TT-Forge is a new MLIR compiler. (Source: Tenstorrent) “We’re finding traction in all kinds of ways, because people can build software on top of our stuff and it works, or we fix it, so they’re pulling for us,” he said. “They like the fact that there’s a real open-source software stack.” Tenstorrent silicon and IP is also built on the open-source instruction set RISC-V . Fed up with the pace of some decisions in the RISC-V world, Keller said the company is now leading the way in some areas. “We’re investing in [RISC-V] compiler technology,” he said. “We lifted the performance of LLVM by 10%, which we contributed to open source. The operating system, drivers, tool chains—everything is getting better. I’m happy; RISC-V is good, we made a good decision and we’re going to make money on it.” RISC-V will win in the long-run over ISAs that allow zero or limited customization, Keller said. “AI code generation is going to change code—it’s going to be way more parallel and it’s going to change CPU architecture,” he said. “With [other ISAs], you have no control over that, and with RISC-V I do, and we are leaning in to it.” Market leader Nvidia recently announced it would license its NVLink IP to selected companies building custom CPUs or accelerators; the company is notoriously proprietary and this was seen by some as a move towards building a multi-vendor ecosystem around some Nvidia technologies. Asked whether he is concerned about a more open version of NVLink, Keller said he simply does not care. “People ask me, ‘What are you doing about that?’ [The answer is] literally nothing,” he said. “Why would I?I literally don’t need that technology, I don’t care about it…I don’t think it’s a good idea. We are not building it.” Tenstorrent chips are linked by the well-established open standard Ethernet, which Keller said is more than sufficient. “Let’s just make a list of what Nvidia does, and we’ll do the opposite,” Keller joked. “Ethernet is fine! Smaller, lower cost chips are a good idea. Simpler servers are a good idea. Open-source software is a good idea.” Keller also highlighted Tenstorrent’s focus on cheaper chip packaging; the company avoids HBM in favour of GDDR6. “If you copy the leader exactly, you’ll get 20% of the market, but at a price discount and you won’t create a new market,” he said. Tenstorrent Blackhole cards. (Source: Tenstorrent) Chinese market Keller knows of at least one company that is using Tenstorrent’s open-source stack for its own AI hardware. This company, based in China, submitted bug reports, which Keller had no problem with the Tenstorrent team fixing. This is part of the nature of open-source software, he said, even if it means potentially helping a Chinese competitor. Tenstorrent does and will continue to address the Chinese market. Previous-gen Wormhole hardware can be shipped to China under current U.S. export regulations, Keller said, but Blackhole will need to be de-featured, provisions for which are built into every part of the silicon. Ascalon CPU IP also has to be de-featured for Chinese customers. “I don’t think it does the U.S. any good to [regulate exports of AI technology],” Keller said, noting that export controls on semiconductor manufacturing equipment have meant China has doubled down on developing this technology internally. “As best as I can tell, in the last five years of regulation of semiconductor equipment into China, that’s sped China up about five years.” “You win through innovation, not regulation. I think that’s been pretty obvious for a really long time,” he added. Tenstorrent currently has European offices in Serbia, Germany and Poland. The company is due to open an office in Cyprus after the government reached out. This office will work on joint projects with Cypriot universities using Tenstorrent computers. Countries want to retain control of their AI technologies, rather than rely on U.S. hyperscalers, Keller said. “They like the fact that our software is open source, so they can do stuff,” he said. Spain is another likely future office location, given the country’s supply of RISC-V talent and support from the government, Keller said. In Japan, where Tenstorrent is working with fledgling foundry Rapidus, work is proceeding. Radpidus’ 2-nm pilot line is up and running, and the foundry delivered a PDK ahead of schedule, Keller said. “We synthesized part of our CPUs and we are sending them feedback,” Keller said. “The numbers were about what we expected.” Jim Keller (Source: Tenstorrent) Training cluster Now that Blackhole chips are available, Tenstorrent is working on building successively bigger training clusters. So far, a training cluster of 6 Backhole Galaxies (192 chips) has been built, with bigger clusters coming over the next six months. The eventual aim is a data plane engine of 16 Galaxy servers, with another 16 Galaxies for switching (Tenstorrent uses its own chips as switches) and another 16 as an optimizer. This includes a certain amount of redundancy. “The demo is going to be [the cluster] running and then you pull any cable out and it doesn’t stop running,” he said. “In principle, we could turn off any server we want and it would keep running.” Korean company Moreh is building a training stack for Tenstorrent hardware, but that is for their own product, Keller said. The stack for Tenstorrent’s own training clusters is being developed in-house. Fast inference can be achieved with four Galaxies (128 chips), Keller said, noting that reasoning is due to require a million times more tokens versus today’s LLM workloads (the real upper bound on the amount of inference compute required is the limit on how many unique questions humans can come up with, he said). Even though inference is likely to be the bigger market in the long term, Keller firmly dismissed any suggestion that the company would or should focus entirely on inference. “I have a mission to radically lower the cost of training,” he said. “The fun challenge is how do you become a proper development platform to do new things, I’m really interested in that. How do you do new things if you can’t train?” Training is an essential part of the stack, just like building an in-house CPU is, Keller said. “I want to build great AI computers,” he said. “That’s the problem with doing part of a thing. [If we focused on serving models from the cloud, for example], what if somebody wants to develop models, where they want to put their own AI technology in their own product? I’m interested in that bigger picture.” This is despite the fact that training and inference are separate, uniquely difficult problems to solve—especially at scale. “Everybody says AI hardware is just a matrix multiplier with some software—that’s the stupidest thing I’ve ever heard,” he said. “Yes, there’s a matrix multipler. Yes, there’s some software. But making it work at scale…” The biggest version of the training computer Tenstorrent is currently planning will have two million RISC-V cores operating in parallel, programmed from a single program. “AI is stylized, it’s not general-purpose HPC programming, but it’s still fairly dramatic, co-ordinating millions of processors from a simple program with tens of people is pretty good,” Keller said. “We are going to build stupidly big computers,” he added. “It’s really fun.” RELATED TOPICS: AI , AI ACCELERATOR , AI SUPERCOMPUTER , ICS , SEMICONDUCTORS Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Sally Ward-Foxton Sally Ward-Foxton covers AI for EETimes.com and EETimes Europe magazine. Sally has spent the last 18 years writing about the electronics industry from London. She has written for Electronic Design, ECN, Electronic Specifier: Design, Components in Electronics, and many more news publications. She holds a Masters' degree in Electrical and Electronic Engineering from the University of Cambridge. Follow Sally on LinkedIn 0 comments Post Comment Leave a Reply Cancel reply You must Register or Login to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed ."
  },
  {
    "title": "OpenGMSL Aims to Overcome Automotive Video Interoperability Challenge",
    "source": "EE Times",
    "date": "2025-06-05",
    "link": "https://www.eetimes.com/opengmsl-aims-to-overcome-automotive-video-interoperability-challenge/",
    "text": "design Lines Automotive Designline OpenGMSL Aims to Overcome Automotive Video Interoperability Challenge By Nitin Dahad 06.05.2025 0 Share Post Share on Facebook Share on Twitter A group of companies representing key points in the automotive value chain have come together to launch the OpenGMSL Association, aiming to bring an open global standard for video data transmission across the automotive ecosystem. The new association will focus on enabling the automotive ecosystem to coalesce around an open standard based on Analog Devices Inc.’s (ADI’s) Gigabit Multimedia Serial Link (GMSL) technology, which ADI said has shipped in over one billion ICs on the road to date and has been deployed over the last 12 years across more than 25 OEMs. The hope is that the technology will address some of the challenges caused by having too many proprietary video connectivity solutions for deploying autonomous driving, advanced driver assistance systems (ADAS) and infotainment applications. Initial members of the not-for-profit OpenGMSL Association are ADI, Aptiv, Coilcraft, Core Microelectronics, Denso Corporation, Ethernovia, Geely Holding Group, GlobalFoundries, Granite River Labs, indie Semiconductor, Keysight Technologies, Hyundai Mobis, Murata Manufacturing Co., NOFFZ Technologies, Omnivision, Qualcomm Technologies, Rohde & Schwarz, Rosenberger Group, Teledyne LeCroy, TDK Corporation, TZ Electronic Systems and Würth Elektronik. In the OpenGMSL press announcement issued by the new association, it states that modern automotive systems’ demands, from ADAS to infotainment and autonomous driving, are growing rapidly. ADAS vision systems heavily rely on high-quality video data to make critical, real-time decisions that improve driver safety and reduce accidents. Partner Content View All The Opportunity for Liquid Sensing By Infineon Technologies  06.05.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency By MRPeasy   06.02.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC By Menta  06.02.2025 Meanwhile, touchscreen infotainment systems demand high-speed, low-latency connectivity to deliver seamless, immersive user experiences. “These factors are driving up development costs for new vehicles, complicating integration, stifling innovation, and ultimately slowing advancements in safety,” according to OpenGMSL. Paul Fernando (Source: ADI) In a written response to EE Times, Paul Fernando, president of the OpenGMSL Association and a marketing director at ADI, explained why ADI and others felt that there was a need to launch this initiative. “For years, ADI has observed rising demands, diverse proprietary solutions, and high investment costs. To sustain advancements, an open, road-proven video connectivity solution is essential,” Fernando said. “The automotive sector faces supply chain challenges, heightened by the pandemic, semiconductor shortages and geopolitical tensions. OEMs and suppliers seek redundancy to avoid reliance on single vendors. Currently, vehicles incorporate multiple non-interoperable technologies, which inflate development costs and slow safety innovations.” “To address this, ADI and industry leaders are collaborating to create a standard that streamlines costs, enhances supply chain resilience, and accelerates market entry,” he added. In this respect, the short-term key milestones of the OpenGMSL Association include growing its membership to strengthen the ecosystem, holding a membership review and acceptance of GMSL2/3 specifications, and conducting interoperability specifications and compliance labs. In the long term, other milestones include expanding into new markets and implementing next-generation specifications. The association will operate under RAND (reasonable and non-discriminatory) licensing terms, and with its own independent board of directors. It aims to encourage global participation and products developed using the standard will require mandatory compliance testing to ensure seamless, multi-vendor interoperability. RELATED TOPICS: AUTOMOTIVE (EV/AV) Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Nitin Dahad Nitin Dahad is editor-in-chief of EE Times. An electronic engineering graduate from City University, he’s been an engineer, journalist and entrepreneur. He was part of ARC International’s startup team and took it public, and he co-founded a publication called The Chilli in the early 2000s. Nitin has also worked with National Semiconductor, GEC Plessey Semiconductors, Dialog Semiconductor, Marconi Instruments, Coresonic, Center for Integrated Photonics, IDENT Technology and Jennic. Nitin also held a role with government promoting U.K. technology globally in the U.S., Brazil, Middle East and Africa, and India. Follow Nitin on LinkedIn 0 comments Post Comment Leave a Reply Cancel reply You must Register or Login to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed ."
  },
  {
    "title": "The Opportunity for Liquid Sensing",
    "source": "EE Times",
    "date": "2025-06-05",
    "link": "https://www.eetimes.com/the-opportunity-for-liquid-sensing/",
    "text": "\"Partner Content\" allows today's industry thought leaders to share their unique insight and perspective with the\n\t\t\t\t\t\t\tgreater ASPENCORE audience. Material published as \"Partner Content\" was created by or on behalf of ASPENCORE's partner(s)\n\t\t\t\t\t\t\tin conjunction with the ASPENCORE Studio team and may not reflect the views of the site and editors to which it is published.For\n\t\t\t\t\t\t\tmore information on this program, email support@aspencore.com design Lines MCU Designline The Opportunity for Liquid Sensing By Infineon Technologies 06.05.2025 0 Share Post Share on Facebook Share on Twitter The trend towards increasing automation and convenience in consumer electronics has paved the way for the integration of intelligent sensing technologies in various products. One such technology is liquid sensing, which enables manufacturers to add smart control and automation capabilities to products that consume or dispense liquids. The liquid sensing feature in PSOC™ 4 Multi-Sense microcontrollers (MCUs) has the potential to transform a wide range of consumer and industrial products, from washing machines and vacuum cleaners to coffee machines and humidifiers. The Challenge: Traditional Liquid Sensing Limitations Historically, liquid sensing has been an impractical option for manufacturers due to the limitations of traditional mechanical, bulky, imprecise, and unreliable technologies. However, with the introduction of Infineon’s Multi-Sense technology, these limitations are now a thing of the past. Additionally, traditional capacitive sensing based liquid sensors suffers from temperature drift and false measurement from impurities, such as soap foam in the liquid, where a reliable detection is challenge. The Solution: Infineon’s Multi-Sense Technology Infineon’s Multi-Sense technology, enabled in the PSOC™ 4 family of microcontrollers, offers advanced capacitive, inductive, and liquid sensing capabilities. This technology allows for contactless liquid presence and level sensing from outside the container, enabling removable containers and providing reliable, accurate, and precise level measurements. Infineon Multi-Sense based liquid sensing can reliably differentiate between liquid and soap foam preventing false activation, stability across temperature and also accurate sensing even with assembly tolerances. The integration of liquid sensing technology into consumer and industrial products opens up new opportunities for manufacturers to add intelligence and value to their products. This technology enables the creation of smart automation capabilities, making products more convenient, easier to use, and optimized for performance. Typical applications include wet vacuum cleaners, washing machines, refrigerators, ovens, water purifiers, coffee machines, and humidifiers, where accurate and reliable liquid sensing can enhance user experience and product functionality. Partner Content View All The Opportunity for Liquid Sensing By Infineon Technologies  06.05.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency By MRPeasy   06.02.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC By Menta  06.02.2025 Liquid sensing technology has a wide range of applications in various consumer and industrial products. Some typical applications for liquid level sensing include: 1. Vacuum Cleaners: A liquid level sensor in a wet vacuum cleaner can indicate to the user how much cleaning time remains in wet cleaning mode based on the level of water in the tank. It can also prevent the user from initiating a brush cleaning cycle without sufficient water, ensuring optimal performance and preventing damage to the machine. 2. Washing Machines: Liquid level sensing can be used to detect the water level in the washing machine drum, enabling the machine to automatically adjust the water level and detergent dosage for optimal cleaning results. Similar, liquid level sensing can be used to detect level of detergent in the machine to auto-dispense adequate amount of detergent for each washing cycle. 3. Coffee Machines: In a coffee machine, liquid level sensing can detect the water level in the reservoir, enabling the machine to automatically stop brewing when the water level is low. This feature can also be used to detect the coffee level in the pot, allowing the machine to automatically switch off when the desired level is reached. 4. Humidifiers: Liquid level sensing can be used to detect the water level in the humidifier tank, enabling the device to automatically switch off when the water level is low, preventing damage to the machine and ensuring optimal performance. 5. Industrial Applications: Liquid level sensing can also be used in various industrial applications, such as monitoring the liquid level in tanks, reservoirs, and containers, enabling real-time monitoring and control of liquid levels. These applications demonstrate the potential of liquid level sensing technology to enhance user experience, improve product functionality, and increase efficiency in various consumer and industrial products. By integrating Infineon’s Multi-Sense technology, manufacturers can create innovative products that offer advanced features, improved performance, and increased value. Coffee Machine Use Case: Brewing a cup of coffee with Liquid Level Sensing The coffee machine use case is a prime example of how liquid level sensing technology can enhance user experience and improve product functionality. The use of liquid level sensing in a coffee machine can provide several benefits, including: Accurate Liquid Level Detection: The liquid level sensor can detect the water/milk level in the reservoir, enabling the machine to dispense correct amount of water/milk needed for coffee and can also automatically stop brewing when the water/milk level is low. Prevention of Dry Brewing: The sensor can also detect when the water/milk level is too low to initiate a brewing cycle, preventing the machine from attempting to brew coffee without sufficient liquids. Real-Time Monitoring: The sensor can provide real-time monitoring of the liquid level, enabling the machine to adjust its brewing parameters accordingly. Cost optimization: In addition to adding intuitive liquid sensing capability, designers may remove traditional flow meters as amount of liquid dispensed can be measured using PSOC™ Multi-Sense liquid sensors, saving BOM cost. Improved User Experience: By providing accurate and reliable water level detection, the coffee machine can ensure that the user always gets the perfect cup of coffee, without the risk of dry brewing or over-extraction. The liquid level sensing solution in the coffee machine use case is implemented using Infineon’s Multi-Sense Converter technology, which enables contactless liquid level sensing outside the tank. The sensor element is mounted outside the tank and affixed to the wall of the tank’s enclosure, allowing for easy removal and replacement of the tank. The use of liquid level sensing in the coffee machine use case provides several benefits, including: Improved User Experience: By providing accurate and reliable water level detection, the coffee machine can ensure that the user always gets the perfect cup of coffee. Increased Efficiency: The sensor can help to reduce waste and energy consumption by preventing dry brewing and over-extraction. Enhanced Product Functionality: The liquid level sensing solution can be integrated with other features, such as automatic descaling and cleaning, to provide a more comprehensive and user-friendly coffee machine experience. Overall, the coffee machine use case demonstrates the potential of liquid level sensing technology to enhance user experience, improve product functionality, and increase efficiency in various consumer and industrial products. The opportunity to embed intelligence and automation in consumer and industrial products through liquid level sensing technology is vast. With Infineon’s Multi-Sense technology, manufacturers can now overcome traditional limitations and create innovative products that offer enhanced user experiences, improved performance, and increased value. Learn more about Infineon’s PSOC™ 4 Multi-Sense. RELATED TOPICS: Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn 0 comments Post Comment Leave a Reply Cancel reply You must Register or Login to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed ."
  },
  {
    "title": "DMMs improve accuracy and usability",
    "source": "EDN Network",
    "date": "2025-06-05",
    "link": "https://www.edn.com/dmms-improve-accuracy-and-usability/",
    "text": "Advertisement The R&S UDS series of digital multimeters (DMMs) offers 5.5-digit and 6.5-digit resolution, with the 6.5-digit model delivering a basic DC accuracy of 0.0075%. Replacing the HMC8012, the UDS DMMs provide higher accuracy and an updated user interface to simplify testing. Streamlining test workflows, UDS models can display up to three measurements simultaneously—such as DC, AC, and statistical data—on a 3.5-inch OVGA color display. They support voltage ranges up to 1000 VDC and 750 VAC, with a current capacity of 10 A. Advertisement With a wide range of measurement functions and remote-control interfaces, the multimeters are well-suited for troubleshooting, component testing, and system validation. They also fit well in teaching labs and production environments. In addition to 12 standard measurement functions, the units offer statistical and math capabilities. Interfaces include USB, Ethernet LAN, and IEEE 488 (GPIB) for SCPI-based control. Advertisement Partner Content The Opportunity for Liquid Sensing 06.05.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC 06.02.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency 06.02.2025 Configure and request a quote for the UDS digital multimeter using the product page link below. UDS series product page Rohde & Schwarz 0 comments on “ DMMs improve accuracy and usability ” Leave a Reply Cancel reply You must Sign in or Register to post a comment."
  },
  {
    "title": "GaN HEMT earns DLA-JANS certification",
    "source": "EDN Network",
    "date": "2025-06-05",
    "link": "https://www.edn.com/gan-hemt-earns-dla-jans-certification/",
    "text": "Advertisement Infineon’s radiation-hardened GaN HEMT is the first in-house manufactured device qualified to the Joint Army Navy Space (JANS) MIL-PRF-19500/794 specification—the highest quality certification issued by the U.S. Defense Logistics Agency (DLA). The company’s new family of radiation-hardened CoolGaN transistors is designed for mission-critical applications in on-orbit spacecraft, manned missions, and deep space probes. The first three devices in the GaN lineup are 100-V, 52-A transistors with a typical R DS(on) of 4 mΩ and a total gate charge of 8.8 nC. Housed in hermetically sealed ceramic surface-mount packages, they are hardened against Single Event Effects (SEE) up to a Linear Energy Transfer (LET) of 70 MeV·cm²/mg using gold (Au) ions. Two of the devices, while not JANS certified, are screened to Total Ionizing Dose (TID) levels of 100 krad and 500 krad. The third device, also screened to 500 krad, meets the rigorous JANS MIL-PRF-19500/794 qualification. Advertisement Engineering samples and evaluation boards are available now, with the final JANS-qualified device set for release in summer 2025. Additional JANS parts will launch soon, expanding the range of available voltage and current ratings. For more information on Infineon’s rad-hard GaN transistors, click here . Advertisement Partner Content The Opportunity for Liquid Sensing 06.05.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC 06.02.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency 06.02.2025 Infineon Technologies 0 comments on “ GaN HEMT earns DLA-JANS certification ” Leave a Reply Cancel reply You must Sign in or Register to post a comment."
  },
  {
    "title": "Multichannel impedance meter analyzes Li-Ion cells",
    "source": "EDN Network",
    "date": "2025-06-05",
    "link": "https://www.edn.com/multichannel-impedance-meter-analyzes-li-ion-cells/",
    "text": "Advertisement The EA-BIM 20005 battery impedance meter from Tektronix uses electrochemical impedance spectroscopy (EIS) across 20 channels to characterize Li-Ion battery cells. With industry-standard interfaces and a compact 19-in., 3U form factor, it integrates easily into automated battery test systems. EIS testing provides deep insight into cell quality. Offering broad-frequency capabilities from 1 mHz to 10 kHz and AC stimulus up to 10 A (peak-to-peak), the EA-BIM-20005 supports comprehensive analysis of battery cell behavior under varying conditions. It is well-suited for cylindrical, pouch, and prismatic cells. Advertisement Each of the meter’s 20 EIS channels is paired with a 4-wire PT100 temperature channel, enabling simultaneous tracking of impedance and cell temperature. An integrated DC power supply delivers up to ±1 A at 5 V for EIS measurements during cell charging and discharging. Included PC software offers built-in visualizations and analysis tools, while connectivity is provided via a USB port and two CAN bus interfaces. Advertisement Partner Content The Opportunity for Liquid Sensing 06.05.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC 06.02.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency 06.02.2025 Access the datasheet and request a quote for the EA-BIM 20005 battery impedance meter using the product page link below. EA-BIM 20005 product page Tektronix 0 comments on “ Multichannel impedance meter analyzes Li-Ion cells ” Leave a Reply Cancel reply You must Sign in or Register to post a comment."
  },
  {
    "title": "Motor gate drivers enable flexible current control",
    "source": "EDN Network",
    "date": "2025-06-05",
    "link": "https://www.edn.com/motor-gate-drivers-enable-flexible-current-control/",
    "text": "Advertisement Two integrated gate drivers from ST provide programmable current control for driving three-phase brushless motors in consumer and industrial equipment. Operating from 6 V to 50 V, the STDRIVE102H supports single-shunt control, while the STDRIVE102BH handles three-shunt control—both configured via two analog pins. Each device can source up to 1 A and sink up to 2 A. A simple resistor divider programs the gate-drive current, allowing the triple half-bridge drivers to control six external N-channel MOSFETs. This helps optimize power stage performance, including control of switching slew rate, without the need for discrete gate resistors. An integrated charge pump powers the three high-side drivers, enabling continuous on-time for the high-side MOSFETs. Advertisement To accelerate development with the STDRIVE102H and STDRIVE102BH gate drivers, the EVLDRIVE102H and EVLDRIVE102BH evaluation boards support field-oriented and six-step control, featuring onboard back-EMF sensing and inputs for position sensors. Standard headers connect to STM32 Nucleo boards, and the X-CUBE-MCSDK toolkit provides the necessary software and code. Advertisement Partner Content The Opportunity for Liquid Sensing 06.05.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC 06.02.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency 06.02.2025 The STDRIVE102H and STDRIVE102BH are available in 5×5-mm or 6×6mm QFN packages, priced from $1.20 each in lots of 1000 units. STDRIVE102H product page STDRIVE102BH product page STMicroelectronics 0 comments on “ Motor gate drivers enable flexible current control ” Leave a Reply Cancel reply You must Sign in or Register to post a comment."
  },
  {
    "title": "Powerline module enables EV charger data links",
    "source": "EDN Network",
    "date": "2025-06-05",
    "link": "https://www.edn.com/powerline-module-enables-ev-charger-data-links/",
    "text": "Advertisement Comtrend’s PM-1540 powerline data module uses MaxLinear’s G.hn (data-over-powerline) chips to support backend communication in EV charging stations. It transmits data from power meters over existing electrical wiring, eliminating the need for dedicated communication cables, and can also extend connectivity to backend systems in data centers or smart parking environments. By leveraging existing electrical wiring, the PM-1540 delivers lower latency, higher speeds, and more stable performance than conventional methods. It enables real-time connectivity while reducing costs compared to LAN, Wi-Fi, or 4G systems. The module supports up to 250 nodes within the same powerline domain and transmits signals over distances up to 700 meters, with up to 16 levels of signal repetition for extended reach. Advertisement MaxLinear’s G.hn baseband processors and analog front-end chipsets provide reliable, low-latency connectivity over existing wiring, delivering physical data rates up to 2 Gbps with full ITU compliance. Their support for Quality of Service (QoS) and broad media compatibility—including powerline—makes them well-suited for EV charging infrastructure, enabling seamless interoperability and cost-effective deployment. Advertisement Partner Content The Opportunity for Liquid Sensing 06.05.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC 06.02.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency 06.02.2025 For detailed information on Comtrend’s PM-1540 G.hn powerline module, click here . An overview of MaxLinear’s G.hn solutions can be found here . Comtrend MaxLinear 0 comments on “ Powerline module enables EV charger data links ” Leave a Reply Cancel reply You must Sign in or Register to post a comment."
  },
  {
    "title": "A quick and practical view of USB Power Delivery (USB-PD) design",
    "source": "EDN Network",
    "date": "2025-06-05",
    "link": "https://www.edn.com/a-quick-and-practical-view-of-usb-power-delivery-usb-pd-design/",
    "text": "Advertisement USB Power Delivery (USB-PD) now offers faster, more efficient, and more versatile power handling solutions. As we can all see, it’s an exciting advancement that significantly enhances the capabilities of USB connections. This mechanism uses the USB configuration channel (CC) to allow a device to request a specific voltage. While this might seem complex at first, it’s pretty easy to utilize in practice. Advertisement Figure 1 The module has several jumpers to set the DC output voltage at multiple levels. Source: Author Advertisement Partner Content The Opportunity for Liquid Sensing 06.05.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC 06.02.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency 06.02.2025 What makes it easy nowadays is that we can buy compact USB-PD Trigger/Decoy modules that do the complicated background tasks for us ( Figure 1 ). You can see such a module has a number of jumpers to set the DC output voltage to 5 V, 9V, 12 V, 15 V or 20 V. This module acts as a trigger or decoy to request specific power profiles from USB-PD power sources such as USB-C chargers, power banks, and adapters. So, with this module, you can trigger USB-PD protocols and thus, for example, charge your laptop via a PD-capable USB-C power supply. Note at this point that a USB-PD Trigger, sometimes called a USB-PD Decoy, is a small but clever circuitry that handles the USB-PD negotiation and simply outputs a predefined DC voltage. Some USB-PD Trigger/Decoy modules are adjustable with a selector switch, or cycle among voltages with a pushbutton press, while others deliver a fixed voltage, or will have solder jumpers (or solder pads to install a fixed resistor) to select an output voltage. The output connection points on these modules are typically just two bare solder pads, or small screw terminals in certain cases ( Figure 2 ). Figure 2 The output connection points are shown on the modules. Source: Author For just a few bucks each, these smaller and slenderer USB-PD Trigger/Decoy modules are useful to have in your tool chest, both for individual projects and for use in a pinch. In my view, for most applications, the fixed voltage type power provider is preferable, as this prevents accidental slips that could destruct the power consumer. I recently bought a set of these fixed voltage modules. As you can see, the core part of these single-chip modules is the IP2721 USB Type-C physical layer protocol IC for USB Type-C input interfaces. Figure 3 IP2721 is a USB Type-C PD protocol IC for USB input port that supports USB Type-C/PD2.0/PD3.0 protocols. Source: Author The USB Type-C device plug-in and plug-out process is automatically detected based on CC1/CC2 pins. The chip has an integrated power delivery protocol analyzer to get the voltage capabilities and request the matched voltage. Figure 4 The schematics shows a design use case built around the USB Type-C PD protocol IC . Source: Injoinic Technology Surprisingly, the newly arrived module—designed for a single, fixed-voltage output—features the IP2721 controller in a bare minimum configuration without the power-pass element. Figure 5 The module features the IP2721 controller in a bare minimum configuration. Source: Author Hence, the output voltage will be whatever V BUS is, and this could be 5 V during initial enumeration or stay at this voltage in case negotiations failed. Luckily, for many applications, this will not be much of an issue. But on paper, to comply with the USB power delivery specifications, the device is supposed to have a high-side power MOSFET as the power-pass element to disconnect the load until a suitable power contract has been negotiated. For this writing, I needed to test the output of my module. So, below you can see a little snap taken during the first test of my IP2721 USB-PD trigger 9-V module; nothing but the process of testing the module with a compatible power source and a DC voltmeter. Figure 6 DV voltmeter shows the output of the IP2721-based USB-PD module. Source: Author Here are some final notes on the power delivery. USB-PD is a convenient way of replacing power supply modules in many electronics projects and systems. Although USB-PD demands specialized controller chips to be utilized properly, easily available single-purpose USB-PD Trigger/Decoy modules can be used in standalone systems to provide USB-PD functionality. Interestingly, legacy USB can only provide a 5-V power supply, but USB-PD defines prescriptive voltages such as 9 V, 15 V, and 20 V in addition to 5 V. Until recently, the USB-PD specification allowed for up to 100 W (5 A@20 V) of power, called Standard Power Range (SPR), to flow in both directions. The latest USB-PD specification increases the power range to 240 W (5 A@48 V), called Extended Power Range (EPR), through a USB-C cable. So, if a device supports EPR expansion commands, it can use 28 V, 36 V, and 48 V. Since the most recent USB-PD specification allows to realize up to 240 W power delivery through a single cable, it’s possible to provide ample power over USB to multiple circuit segments or devices simultaneously. Electronic marking is needed in a Type-C cable when V BUS current of more than 3 A is required. An electronically marked (E-Marked) cable assembly (EMCA) is a USB Type-C cable that uses a marker chip to provide the cable’s characteristics to the Downstream Facing Port (DFP). It’s accomplished by embedding a USB PD controller chip into the plug at one or both ends of the cable. The USB-PD Programmable Power Supply (PPS) was implemented with USB PD3.0. With PPS, devices can gradually adjust the current (50-mA steps) and voltage (20-mV steps) in the range from 5 V to 20 V. PPS can directly charge a battery, bypassing the battery charger in a connected device. Adjustable Voltage Supply (AVS) was implemented with USB PD3.1 and extended with PD3.2, allowing it to work within SPR below 100 W, down to a minimum of 9 V. AVS is similar to PPS in terms of function, but the difference is that it does not support current-limit operation, and the output voltage is adjusted in 100-mV steps in the range from 9 V to 48 V. Note that USB-PD, which is combined with USB-C, takes full advantage of the power supply and multi-protocol functions over USB-C. Implementing USB-C for portable battery-powered devices enables them to both charge from the USB-C port as well as supply power to a connected device using the same port. So, devices using a single or multicell battery charger can now be paired with a USB-C or USB PD controller, which enables the applications to source and sink power from the USB-C port. Below is an application circuit based on MP2722, a USB Type-C 1.3 compliant, highly integrated, 5-A, switch-mode battery management device for a single cell Li-ion or Li-polymer battery. Figure 7 The application circuit is built around a 5 A, single-cell buck charger with integrated USB Type-C detection. Source: Monolithic Power Systems (MPS) In the final analysis, it’s important to recall that the USB-PD is not just about the power delivery-related negotiations. Feel free to comment if you can help add to this post or point out issues and solutions you have found. T. K. Hareendran is a technical author, hardware beta tester, and product reviewer. Related Content Understanding USB Power Delivery 3.2 USB Type-C PD 3.0 Specification, Charging and Design Providing USB Type-C connectivity – What you need to know USB Power Delivery: incompatibility-derived foibles and failures USB-C PD 3.1 EPR: A Full System Design Solution, Wall to Battery 0 comments on “ A quick and practical view of USB Power Delivery (USB-PD) design ” Leave a Reply Cancel reply You must Sign in or Register to post a comment."
  },
  {
    "title": "Ambature to Deliver Superconductor IP for AI’s Energy Problem",
    "source": "EE Times",
    "date": "2025-06-04",
    "link": "https://www.eetimes.com/ambature-to-deliver-superconductor-ip-for-ais-energy-problem/",
    "text": "design Lines AI & Big Data Designline Ambature to Deliver Superconductor IP for AI’s Energy Problem By Nitin Dahad 06.04.2025 0 Share Post Share on Facebook Share on Twitter After AI, energy efficiency probably ranks as one of the next most important topics of discussion in industry. As the number of GPUs and data centers grows at what appears to be exponential rates, these core elements of the engine driving AI infrastructure consume significantly more power. So, could superconductors, and especially high-temperature superconductors (HTS), be part of the solution to arrest some of the growth in energy needs? According to Ambature, a manufacturer of a-axis superconducting technology, superconductors have physics-based advantages over semiconductors for some sensing and processing applications, enabling high-speed interconnects with extremely low heat dissipation, faster or more energy-efficient logic circuits for high-performance computing (, efficient RF systems for telecommunications, and quantum magnetometers for evaluative and diagnostic imaging, as well as navigation in GPS-denied environments. The company stated that computers made with superconductors will be at least 1,000× more energy-efficient than today’s computers. Partner Content View All The Opportunity for Liquid Sensing By Infineon Technologies  06.05.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency By MRPeasy   06.02.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC By Menta  06.02.2025 “For example, under moderate assumptions, GPUs made with Ambature’s HTS materials and devices will be 1,905 times more energy-efficient than Nvidia’s 2025 HGX B200 GPUs ((BF16) 8,572 TOPS/W vs. 4.5 TOPS/W). Under the least favorable assumptions, the efficiency multiplier is 342x (1,541 TOPS/W). Under the most favorable assumptions, the efficiency multiplier is 16,878x (75,953 TOPS/W).” Ambature also explained that computers made with superconductors can also run several times faster than today’s computers (e.g., 20-30 GHz compared to 2-6 GHz) because superconducting interconnects are 1,000–100,000 less resistant than copper interconnects for most practical critical dimensions and operating frequencies (YBCO vs. copper). As a result, resistance-capacitance delays will be minimized. Semiconductor logic circuits can also benefit from superconducting high-speed interconnects and vias (replacing the majority of back-end metallization layers) using heterogeneous integration techniques (such as thermocompression bonding) while superconducting logic technologies mature. There are other benefits of superconductors , such as smaller data centers, no need for water cooling and so on. So, what is stopping the widespread adoption of superconductors? To date, it has been due to the low temperature requirements for operation and complex fabrication processes. Initial focus on quantum sensors and processors Ambature claims to have addressed these challenges for several important sensing and computing applications and has had some successful trials in various military applications. Josephson junctions are fundamental components of many superconducting electronics like sensors, quantum computers, and energy-efficient classical computers. Ambature has created vertical HTS tunnel junctions with a-axis (see left) cuprates, which the company said has major advantages over c-axis devices (right), including factors like temperature, speed, density, tunability, throughput and fabrication. (Source: Ambature) We caught up with the company’s president and CEO, Ron Kelly, as well as board member Raj Jammy, recently in the UAE straight after they delivered their talk at the Future of Semiconductors conference in Jeddah, Saudi Arabia, to learn more about Ambature and what the company has been doing since being founded in 2007. We also covered their technology, recent milestones, how the company plans to enable manufacturing at scale and its go-to-market strategy. Watch our video interview with Ambature’s Ron Kelly and Raj Jammy below: Kelly and Jammy talk about the signing of a joint development agreement with a large Silicon Valley company to help move Ambature’s technology from lab to fab. This is seen as a very important milestone for the company, aiming to transfer the technology into a manufacturing recipe (PDK) within the next year to enable scaling. Kelly also talks about their initial focus on quantum sensors and quantum processors, their relationship to AI, as well as getting its quantum sensor, SQUID (superconductive quantum interference device), to commercial quantities. We also learn about the Josephson junction, which is a core architecture for superconductive qubits (though Ambature is not currently focused on qubits but rather HPC and sensing). A central theme of the discussion was around addressing the fundamental challenges in traditional CMOS semiconductor technology. Jammy explained the bigger picture of superconductors’ role in reducing energy consumption due to their ability to conduct electricity at zero losses, and how this can lead to new paradigms in devices. He said Ambature’s Josephson junction processor is seen as a potential “panacea for eliminating the inefficiencies” in data centers and significantly reducing power requirements—all while improving computation density and Performance We also learn how Ambature has proven a unique way of growing superconducting films on silicon with the right buffer layers. The company is now working on forming Josephson junctions with this material. Ambature’s core IP is in how the material is put down and processed to make junctions, interconnects or quantum sensors. The company claims to possess one of the largest high-temperature superconductor IP portfolios globally. In the conversation, we also talked about the company’s technology being part of a heterogeneous computing ecosystem, since the future of computation is heterogeneous and Ambature’s technology is likely to be one of the components. Finally, we discuss Ambature’s immediate ambition, including seeking significant funding to enable the company to scale significantly in terms of people, market development, sales and physical facilities. Related articles: Are Superconducting Power Lines Still a Viable Option? RELATED TOPICS: AI AND BIG DATA , POWER MANAGEMENT Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Nitin Dahad Nitin Dahad is editor-in-chief of EE Times. An electronic engineering graduate from City University, he’s been an engineer, journalist and entrepreneur. He was part of ARC International’s startup team and took it public, and he co-founded a publication called The Chilli in the early 2000s. Nitin has also worked with National Semiconductor, GEC Plessey Semiconductors, Dialog Semiconductor, Marconi Instruments, Coresonic, Center for Integrated Photonics, IDENT Technology and Jennic. Nitin also held a role with government promoting U.K. technology globally in the U.S., Brazil, Middle East and Africa, and India. Follow Nitin on LinkedIn 0 comments Post Comment Leave a Reply Cancel reply You must Register or Login to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed ."
  },
  {
    "title": "Arm Launches Zena to Accelerate AI-Defined Vehicle",
    "source": "EE Times",
    "date": "2025-06-04",
    "link": "https://www.eetimes.com/arm-launches-zena-to-accelerate-ai-defined-vehicle/",
    "text": "design Lines Automotive Designline Arm Launches Zena to Accelerate AI-Defined Vehicle Platform speeds automotive development, streamlining compute and accelerating time-to-market. By Pablo Valerio 06.04.2025 0 Share Post Share on Facebook Share on Twitter As the automotive industry is transitioning rapidly from vehicles primarily defined by their hardware to sophisticated platforms where software and AI increasingly drive functionality and user experience, Arm is introducing its Zena Compute Subsystems (CSS) platform. Building on the foundation of the software-defined vehicle (SDV), this evolution is moving towards a future envisioned as the AI-defined vehicle (ADV). This shift introduces significant complexity and places immense demands on hardware and software development. Positioned as a pre-integrated and pre-validated platform, Zena CSS aims to streamline and speed up silicon and software development for the emerging ADV era. Accelerating the transition to the AI-defined car The AI-defined vehicle builds upon the infrastructure of the SDV, where AI models become pervasive both in the cloud and within the car itself, driving innovation across functions like advanced driver assistance systems (ADAS), in-vehicle infotainment (IVI), and core vehicle controls. Partner Content View All The Opportunity for Liquid Sensing By Infineon Technologies  06.05.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency By MRPeasy   06.02.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC By Menta  06.02.2025 It necessitates a dramatic increase in compute demands and leads to what Arm’s SVP and GM of Automotive Line of Business, Dipti Vachani, described as an “explosion of software.” Arm’s Dipti Vachani Ms. Vachani highlighted discussions with automakers and partners, noting three key industry needs driven by this trend: the need for flexibility to innovate and define their brand experience, the necessity to scale AI across different vehicle models and applications, and the urgency to accelerate time to market. She stated that Arm is focusing on addressing these challenges. Zena compute subsystems Arm Zena CSS arrives as a direct response to these industry challenges. It is a pre-validated subsystem that provides a standardized, trusted compute foundation, built on Armv9 Automotive Enhanced (AE) technology. The first-generation Zena CSS includes a high-performance compute block with a 16-core Arm Cortex-A720AE CPU cluster, a safety island featuring a Cortex-R82AE for real-time processing and functional safety, a security enclave leveraging Arm TrustZone technology, and system interconnects including CMN S3AE for CPU coherency and chip-to-chip connectivity. By providing these essential components in a pre-verified block, Arm aims to handle foundational tasks, freeing partners to focus their engineering efforts elsewhere. Streamlining development Arm claims that using Zena CSS can significantly reduce the effort required by silicon makers. The company states it can reduce silicon development time by up to 12 months and the number of engineers needed per project by 20%. Ms. Vachani emphasized the value created by pre-validating this block, stating it saves “money and time.” She added that it allows customers to “design confidently and scale efficiently,” enabling them to “move fast.” This approach allows silicon partners and automakers to focus their engineering efforts on areas differentiating their products. Partners can easily integrate their or Arm’s specialized IP alongside the Zena CSS block. This includes Arm’s Mali GPUs and ISPs for enhanced vision and graphics capabilities and partner-specific accelerators for AI functions (NPUs). Ms. Vachani highlighted that with Zena, developers “can focus on AI […] and that allows them the maximum flexibility necessary to design around it and focus on the areas that differentiate.” This flexibility in adding AI and graphics acceleration is key to defining an AI-defined vehicle’s unique characteristics and consumer experience. Scalability across applications and systems Scalability is another key aspect of the Zena CSS strategy. The Zena CSS block works across different applications within a vehicle. It includes critical domains like ADAS, IVI, and potentially Vehicle Control. Using the same Zena block provides consistency across the vehicle. Zena CSS (Source: Arm) Additionally, allows for reuse across different vehicle models and portfolios. Ms. Vachani stressed the importance of scale, stating, “Scale matters. Scale matters in this industry” because doing things “bespoke anymore” for every model is not feasible. Multiple Zena CSS blocks can be present within a single chip or package for applications requiring higher compute performance. The consistent hardware and open standards also mean that software developed for Zena CSS can be reused and deployed across different applications and vehicle models. As Ms. Vachani put it, once developed, software can “deploy everywhere.” Fast-tracking development Software is becoming a critical path to deployment in AI-defined vehicles. Arm addresses this by making Zena CSS available on virtual prototypes from day one. Furthermore, it allows software developers to begin innovating on the platform before physical silicon is ready, potentially accelerating software development timelines by up to two years compared to traditional serialized approaches. Source: Arm Ms. Vachani described this capability as “magic” for the industry, helping customers “save up to two years.” The availability of virtual prototypes also contributes to a “consistent environment cloud to the car.” “Virtual prototyping on a common compute foundation not only reduces time-to-market but also aligns with our vision of a more software-centric, flexible automotive ecosystem,” noted Masashige Mizuyama, CTO at Panasonic Automotive Systems Co. The platform supports a robust software ecosystem built on open standards, including those from the SOAFEE (Scalable Open Architecture for Embedded Edge) foundation. Ms. Vachani described Zena CSS as a “physical manifestation” of the SOAFEE standard, meaning software developed to this standard “just works” on the Zena CSS, leveraging years of ecosystem effort. Magnus Östberg, Chief Software Officer at Mercedes-Benz AG, commented: “Standardized, pre-verified compute subsystems like Arm Zena CSS can significantly accelerate development timelines and reduce complexity across the industry.” Ms. Vachani argues that the future of automotive is moving towards AI-defined and asserts, “The AI-defined vehicle will be built on ARM.” Broader automotive semiconductor landscape The competitive landscape for automotive compute is dynamic, with established semiconductor companies offering various System-on-Chips (SoCs) and platforms. Players like NVIDIA, Qualcomm, Intel/Mobileye, Renesas, and NXP provide a range of solutions for high-performance ADAS/AD compute, digital cockpits, and vehicle control. These companies are developing increasingly complex and heterogeneous SoCs featuring powerful CPUs, GPUs, and specialized AI accelerators (NPUs) to handle the demands of the AI-defined vehicle. Within this landscape, the RISC-V open-standard instruction set architecture (ISA) is also emerging as a pivotal technology, particularly in the European and Asian automotive sectors . Infineon announced a new RISC-V-based AURIX microcontroller family and NXP is leveraging RISC-V for specialized accelerators. Arm’s approach with Zena CSS is distinct. As Ms. Vachani clarified, Arm is not building and marketing its own ultimate chips like these companies. Instead, Arm licenses its IP cores and now, with Zena CSS, offers a larger, pre-integrated subsystem. This allows Arm’s partners—including semiconductor companies, Tier 1 suppliers, and potentially others—to build their own differentiated SoCs more rapidly and with reduced risk. Broad availability after the summer Arm Zena CSS is shipping to select partners today. Broader availability will come later this year, in September 2025. Software developers can begin using Zena CSS immediately through virtual platforms. RELATED TOPICS: AI , AUTOMOTIVE , SDV , ZENA CSS Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Pablo Valerio Pablo is a seasoned engineer with 30+ years of experience. For over 10 years, he's been a contributing editor for EE Times (where he edits the Supply Chain section). He also wrote for EPSNews, InformationWeek, EBN, LightReading, Network Computing, and IEEE Xplore. His coverage spans Supply Chain, Semiconductors, Networks, IoT, Security, and Smart Cities. He holds an MEng, Electrical and Electronics Engineering from The Ohio State University. Follow Pablo on LinkedIn 0 comments Post Comment Leave a Reply Cancel reply You must Register or Login to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed ."
  },
  {
    "title": "10-octave linear-in-pitch VCO with buffered tri-wave output",
    "source": "EDN Network",
    "date": "2025-06-04",
    "link": "https://www.edn.com/10-octave-linear-in-pitch-vco-with-buffered-tri-wave-output/",
    "text": "Advertisement Frequent contributor Nick Cornford recently assembled an ensemble of cool circuit designs incorporating linear-in-pitch VCOs (LPVCOs). “ A pitch-linear VCO, part 1: Getting it going ” “ A pitch-linear VCO, part 2: taking it further ” “ Revealing the infrasonic underworld cheaply, Part 1 ” “ Revealing the infrasonic underworld cheaply, Part 2 ” These elegant and innovative designs (standard fare for Nick’s contributions) were perfectly adequate for their intended applications. Nevertheless, it got me wondering how difficult it would be to implement an LPVCO with a range covering the full 10-octave audio spectrum, from 20 Hz to 20 kHz. I even decided to try for extra credit by going for a tri-wave output suitable for direct drive of one of Nick’s famous squish-diode sine converters. Figure 1 shows the result. Advertisement Figure 1 An LPVCO with 10-octave (20 Hz to 20 kHz) tri-wave output comprises antilog pair Q1 and Q2, two-way current mirror Q3 and Q4, integrator A1b, comparator A1a, and buffer A1c. Resistors R1 and R2 are precision types, and T1 is a Vishay NTCSC0201E3103FLHT (inhale!). Advertisement Partner Content The Opportunity for Liquid Sensing 06.05.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC 06.02.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency 06.02.2025 Wow the engineering world with your unique design: Design Ideas Submission Guide Vin is scaled by the tempco-compensating voltage divider, ((R1+T1)/R2 + 1) = 28:1 , and applied to the Q1 and Q2 antilog pair, where Q1 level shifts and further temperature compensates it. Then, with the help of buffer A1c, it’s antilogged and inverted by Q2 to produce Ic2 = 2 (2Vin) µA = 1 µA to 1 mA for Vin = 0 to 5v. From there, it goes to the two-way current mirror: Q3 and Q4. A description of how the TWCM works can be found here in “ A two-way mirror—current mirror that is .” The TWCM passes Ic2 through to the integrator A1b if comparator A1a’s output is zero, and mirrors (inverts) it if A1a’s output is high. Thus, A1b ramps up if A1a’s output is at 0v, and down if it’s at 5v, resulting in sustained oscillation. The C1 timing ramp has a duration in each direction ranging from 25 ms (for Vin = 0) to 25 µs (for Vin = 5v). The triangular cycle will therefore repeat at Fosc = 2 (2Vin) µA/(25nCb)/2 = 20(2 (2Vin) ) Hz. So, there’s the goal of a tri-wave LPVCO with an output span of 20 Hz to 20 kHz centered at 640 Hz, and it wasn’t so terribly messy to get there after all! My thanks go to Nick Cornford for introducing the LPVCO to Design Ideas (DIs), and to Christopher Paul and Andy I for their highly helpful simulations and constructive criticisms of my halting steps to temperature-compensating antilogging circuits. I also thank editor Aalyia Shaukat for her DI environment that makes such teamwork possible for a gang of opinionated engineers, and mostly accomplished without actual bloodshed! Mostly. Stephen Woodward ’s relationship with EDN’s DI column goes back quite a long way. Over 100 submissions have been accepted since his first contribution back in 1974. Related Content Seven-octave linear-in-pitch VCO A pitch-linear VCO, part 1: Getting it going A pitch-linear VCO, part 2: taking it further Revealing the infrasonic underworld cheaply, Part 1 Revealing the infrasonic underworld cheaply, Part 2 0 comments on “ 10-octave linear-in-pitch VCO with buffered tri-wave output ” Leave a Reply Cancel reply You must Sign in or Register to post a comment."
  },
  {
    "title": "Seeing inside entry-level audiophile desire: Monoprice’s Liquid Spark Headphone Amplifier",
    "source": "EDN Network",
    "date": "2025-06-04",
    "link": "https://www.edn.com/seeing-inside-entry-level-audiophile-desire-monoprices-liquid-spark-headphone-amplifier/",
    "text": "Advertisement My audio gear Back in July 2019 , I told you about the combo of Massdrop’s x Grace Design Standard DAC : Advertisement and its companion Massdrop Objective 2 Headphone Amp: Desktop Edition (Massdrop is now just Drop , by the way, and is now owned by Corsair ): Advertisement Partner Content The Opportunity for Liquid Sensing 06.05.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC 06.02.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency 06.02.2025 that I’d recently acquired for listening to computer-sourced audio over headphones in a quality-upgraded fashion beyond just the DAC (and amp-fed headphone jack) built into my Mac. That same two-device stack: remains on my desk and to my right to this very day, albeit subsequently joined by an even higher quality balanced audio stack to my left : combining a Topping D10 Balanced DAC : and a Drop + THX AAA 789 Linear Headphone Amplifier : The Monolith But I digress. Today’s dissection showcase is of none of these. Instead, I’ll be analyzing the guts of the Monolith by Monoprice Liquid Spark Headphone Amplifier by Alex Cavalli : It’s comparable in size to the Massdrop Objective 2 Headphone Amp: Desktop Edition I mentioned at the beginning of the writeup: And what about a companion digital-to-analog converter? That’s a story all by itself. It originally had one, the unsurprisingly named “ Monolith by Monoprice Liquid Spark DAC by Alex Cavalli ”: based on an Asahi Kasei Microdevices (AKM) Semiconductor DAC chip. However, in October 2020, just as COVID was in general throttling the tech economy , audio equipment suppliers got a double-whammy: a massive three-day fire at AKM’s semiconductor facility in Japan, which clobbered its output. Some AKM customers, such as Fiio and Schiit (the latter, for example, redesigning and renaming its Modi 3 DAC as the Modi 3e, with “e” short for ESS Technology ), revamping their systems to use chips from other suppliers instead. Others, like Monoprice, threw in the towel. That said, since the Monoprice Liquid Spark headphone amp has conventional RCA (unbalanced) analog line inputs, you can use it with any standard DAC. A bit of background info A few definitions before proceeding with the dissection. “Monolith” is Monoprice’s audio products brand . Alex Cavalli is a now-retired, well-known audio amplifier designer who, in addition to selling both self-branded Cavalli Audio equipment (now repaired by Avenson Audio since his retirement) and gear branded by Monoprice (obviously) and Massdrop/Drop, also published complete design documentation sets for others to use in building their own gear, DIY style . Alex is a contemporary of another audio amplifier “wizard” whose name may be more familiar to you: Nelson Pass . And finally, why do I categorize it as being for “entry-level audiophiles”? The feature set, for one thing. I’ve already noted that it doesn’t offer balanced inputs and outputs, for example, the magnitude-of-benefits of which are debatable, anyway . That said, unlike the Massdrop Objective 2 Headphone Amp: Desktop Edition, it does include preamp outputs, the benefit of which I’ll elaborate on shortly. And its performance is nothing to sneeze at: Manufacturer-published spec sheet (PDF) Manufacturer-published test measurement graphs (PDF) Independently published testing results (Audio Science Review) Independently published testing results (Super Best Audio Friends) And the price, although that’s an imperfect-at-best barometer of quality. That said, Schiit’s current high-end solid-state Mjolnir 3 headphone amp (the company also sells tube-based products) goes for $1,199-$1,299, depending on color. Conversely, when the Liquid Spark Headphone Amplifier was introduced in 2018 (a year after Alex Cavalli announced his retirement, interestingly), Monoprice sold it for $99. Its list price is now $129. But (in explaining how I first came across it) I’ve long subscribed to Monoprice’s periodic promotional emails, and back in March of last year, I stumbled across a smokin’ deal; $32.49 each plus a further 25%-off discount. I bought two at $50.29 total (with tax), one for a buddy’s birthday, the other for me. What I’ll be taking apart today is neither of these devices, however. Last October, while searching for a Liquid Spark DAC mate to my headphone amplifier, I stumbled across “as-is” Liquid Spark amps on eBay for $29.99 plus tax and $9.99 for shipping. The seller notes said: Pulled from a professional working environment. Tested for power, no further testing was done. Due to lack of knowledge and having the proper equipment to fully test these units, we are selling AS-IS for parts/not working. Unit shows some signs of scuffs/scratches all around the unit. Please refer to the photos for more detailed information on the cosmetic condition. As I’ve mentioned (and exemplified) many times before, such “for parts only” listings are perfect for teardown purposes. I ended up getting one for $20.99 (plus the aforementioned sales tax and shipping). I’m not sure how the seller “tested for power”, since it didn’t come with the requisite “wall wart”. And as you may have already noticed from the back panel “stock photo” shown earlier, it’s an uncommon one, outputting 36V at 1.25A min (that said, at least it’s got a DC output; Schiit’s are all just AC transformers ). Overview I have no idea if this one actually works, and I’m not going to chance zapping my personal amplifier’s functional PSU to find out. That said, here it is in all its cosmetically imperfect glory, as usual accompanied by a 0.75″ (19.1 mm) diameter U.S. penny for size comparison purposes (the unit has dimensions of 4.6″ x 3.7″ x 1.5″/117 x 94 x 38 mm and weighs 9.6 oz./271g): Left-to-right are the power switch, a ¼” TRS headphone jack, a 3-or-6 dB gain switch (to accommodate headphones of varying impedance ), and a rotary volume control knob. Now, about that back panel (following up on my earlier “teaser” comment about the RCA output set): Most headphone amps in this price range have unbalanced RCA inputs , but their only output is an unbalanced TRS headphone jack (of varying diameter) up front. But this one also has a pair of unbalanced RCA outputs . And they’re not just simple line level pass-throughs, either; they route through the internal preamplifier first, although they (obviously) then bypass the headphone amplifier circuitry. Why’s this nice? Well, you can connect them to an external power amplifier to drive a set of speakers from the same audio source. And, because the preamp is still in the loop, the headphone amp’s volume control manages speaker volume, too. The one thing I don’t know (and haven’t tested with my unit) yet, and the user manual doesn’t clarify, is whether the two output sets operate simultaneously or (as is the case with Schiit’s device equivalents) in a one-or-the other fashion. Said another way, when you plug in some “cans”, does this also mute the sound that would otherwise come out the connected speakers? Onward: the left and right sides: The top: and bottom: complete with a label closeup: I admittedly enjoyed fondling this device, both in an absolute sense and relative to the scores of predominantly plastic-based products I’ve taken apart in the past (and will undoubtedly continue to do so in the future). It’s heft…the solidity of its all-metal construction…very nice! Teardown time Speaking of that all-metal construction, let’s start by getting the front panel off, starting with the Torx head screws on both ends: Part of the way there… Let’s see what’s behind that volume knob, which was snugly attached but pulled off after a bit of muscle-powered coercion: Unscrew the nut, remove the washer: and this part of the total task is successfully completed: Check out that gloriously thick and otherwise solid PCB! Now for the back panel. Six screws there and another one below: And the panel-still-attached PCB slides out the rear: Voila! Jumping forward to the future for a moment, I went back and perused the product page after the teardown-in-progress and found this, which I hadn’t noticed earlier: It wasn’t surprising. It was, conversely, validating. Truth be told, even before I took this amp apart, I’d suspected I’d encounter a discretes- (vs op amp-) based design . And when I saw the horde of tiny ICs scattered all over the top of the PCB, my in-advance hunch was validated. Before diving in, let’s first flip the PCB over and take a look at the other side: Not as much to see here, aside from this closeup: The largest two ICs shown, which curiously don’t have their own PCB-marking notations, versus the resistors and capacitors surrounding them (perhaps the marks are underneath the chip packages) are labeled as follows, along with what I think is a STMicroelectronics logo: 071I GZ229 Any idea what they are, readers? Back to the front for a close-up of the most interesting section: The largest packaged parts on this side are a mix of what I believe to be QJ423 p-channel and QJ444 n-channel MOSFETs , both curiously identified in online specs as intended for automotive applications. And look, Alex even brands his PCBs! I’ll close with a few side views of the solid-construction circuit board: And that’s all I’ve got for you today. I’ll hold onto the disassembled device for a while in case you have any specific questions on the markings on some of the other, tinier ICs and/or passives. And, as always, I welcome your thoughts in the comments. Bonus points for anyone who is able to dig up an Alex-authored DIY schematic that corresponds to this design! — Brian Dipert is the Editor-in-Chief of the Edge AI and Vision Alliance, and a Senior Analyst at BDTI and Editor-in-Chief of InsideDSP, the company’s online newsletter. Related Content High quality and lossy: Audio upgrades don’t need to be costly FiiO transitions: Technology evolutions Putting an audiophile “tweak” to the test Decoding and virtualization bring surround sound to the masses How to stop worrying and love compressed audio Microphones: An abundance of options for capturing tones 1 comment on “ Seeing inside entry-level audiophile desire: Monoprice’s Liquid Spark Headphone Amplifier ” imreac June 5, 2025 Ah yes… another Audiopile fetish article.  I spent decades in the Audio business, designing and testing lots of equipment, watching the early fetish crowd (with McIntosh chrome plated chassis stuff) migrate to weird tube and discreet circuits.  Saw the appearance of specialized audio fetish magazines & the rise of many “golden ear” “evaluators”.  Every now and then, I was challenged to prove that it was all emotional belief based bias nonsense.  So I would set up a simple A-B-X test at the venue of peoples choosing, often a high end listening room of a Hi-Fi store, but a few recording studios as well.  Sources were LPs (like Sheffield direct to disc) and 7.5 & 15 ips half track R-R master tapes.   Even Southern California’s best golden ears always lost.  It got to the point that no one would come, because they were guaranteed to be embarrassed.   Keep the mystique alive! Log in to Reply Leave a Reply Cancel reply You must Sign in or Register to post a comment."
  },
  {
    "title": "Smart Design Tips for IoT Nodes to Last for Decades",
    "source": "EE Times",
    "date": "2025-06-03",
    "link": "https://www.eetimes.com/smart-design-tips-for-iot-nodes-to-last-for-decades/",
    "text": "Y~70|!�׳����H\u0011Yf�\u0001X�H2��������1����\u0007Dj\u0003���\u0007�s�+d¸K\u0018���/�\r\u0014���؅���ڭ<\u0013����\u001a\u0007�:s�6P��\"��\u0001`�,�?\u000eQ�>���\u0002\u0000\u0011�q\u001f�]��\b�&��k)Ӧ �z\u0001\u0005쏊�\u0007NA�U��:({�\u000b\u001c�P\u001e��\u0010�����ÕW\u0017�^]���\u001f�1�>\u0002Ԝ�&�<��1��ݺS��x2\u0015�@c%k�\u001cch���\n���ኸ=�/e:��%�#a��ey\u0010a�\u0006�ko1�\u0018B��[©��J]1�;�x\u0013[\u000e���\u0001^����1�������Ov���Y�\bͥT+�\u001d]\u001bܹ�ܙ�+�B�l\u0015F��\u0000�\u0018\u0002\u000e\\�N\f0\u0016\u000b��E\u0017�@�\u001a\u0013�\u0002<�=>H�\u0002>��M3�{�\u0013q�ϡ;���/L\u000eJ����k̈z\u0001�<�!\u0000�J��w\u0004��7�J\u001a���\u0012�H��\u0002�<�������\b�\u0014�\u0018!I�(���\u001f��;c\u0001t=*��F]|�gl\"�\u0016-_\u0017y�b�J5�g4z-�A�\u0017R��5��̶d$mWJi�M1s�W�.���C�&��Գw\b>�oj{\u0011��lO�\u0007�\u0010s\u000eG�-q��G���\u0006u�tN\u000e8����Iυ����]��5��m��{��澋0z*ƨ�{�� m$V��\u001f�Lw�r�T�š�ޔ�ޥ)^�����<��O�|�:�\tgpu{�|��eKz\u000fjϬ!0\u001d�t;�\u0011F\u0019�.0�fbW\u00005�끶��$\r��pB�ߘ%�t1)׋Vgюq4�\u0003�Js.C/��}a왋i�LlƎc�\u000b�ɿ�/օ\u0018xx+_,����̀���\u000b��4�_\u0017m��T8\u001d�>h��G����\u0014E^��A\u0003ʍ�\\\u001c<\u0015������(<�ۣ�cX�\u0011�o@�v�p٫߻���4\u001f=�D��){�8�����\u000e=�4j~?���6F��.�ч ��\u0010��%-��T\"&9�2�\u0003B\u001f\u000b\u001e\"\u0006��*���h_��\u0002\u001fU$���\u0002\u001e�KD��N\u0014Q���H\u000b\u001a���)�\u0006\u0012\u0000\u0006n�'願�;)�;�\u000e�$���,����m\u001d&d�7�;��\u0004��/+?\u000e\n����\u001b��,~��+�)g��\u0015vz\b.�-��N���\u001e�\u00117��\u0016{7�9z3�j�������\u0001�DsO�\t��\u0006N�#��\u0000_-�ś�R��\n����0l�=]��r��_�|��7�<-�*�<���G��[�\u0002��)�;�0�\u0004O�T�#�\u001a!�@�I\u0001@�|��\u001d����C{cKg�&�\u0006k��\u0016H����ʶ0\u0006�i!\u0010�o�7\u0017@a�$K�TUw����\u0002=\n�\u0006\b�{z�p\u0002x\u0000�\u0000�Y\"uF�;!�<0\u0019j�����\u000f\u0018�\u0000!ܞ\u0002<5W\u001e��\u001d�\u0013�`�)=�ڸgd\u0001�8��b\u0006=��͍�:PH�'��\\<��Ӷ\t�\b��*����)\u0005�\u0004]e8:A*�\u001f��l�EIRT0m\u000bɊ�h���\u001f��>~��yd<��\u001eZ��%�?��P�v�7�ќf#��W�GOY7j��e=\u0002\u001cL�\t&�\t8V�\u0012*\f&/�Ǒq���0$\u001e��*N��\u0003\ba8�n{�����t\u0015\\\n(f�s`�h�ɪ�\u0016�\u000bH?x��O�Y\t#Z�^�к\t�\u0006f�R�\u0012��\u0004�^���Y4��E\u001b\u0013�\u0001�5������̀w��\u000f����\u001e_��VZ�.�s>[�f\b\u001b\u0015#��V`�\u0017l����/\u0005���\u0001�Y�:z/�.\u0004aaHJ�\u0017{�3\u001f���\u0011��\f-\nb\u0007nX*��\u0017őP*̮�E\u0012�W�%\\�i��v\t ���#��E\u0004��}:�gb�~�\u0013�Y�Y7�Y��G?��u��\u0011���o\u0006x�>���%9;\u0010�\u0013�X`��v�\u001c�~\t2�/�#�5=�/���פ\u0012��Ŧ�\u0006w���\u001b|D�������������5\u001f�=/��\f<�<�\u0018\u001bk��(X��5f\u0003�+���1�t����_c�lΏ�c��;6\f���G�c�\u000b��^��Q�e/RԘP���e��C���������\u001d��cU�8Z�?\u000f&}z���\u0005U�\u0005�heP.�xȧ.��\"��Ges~�ݎ���{�@U=�FU�R�>� �\u0007��'u���:2/��\u0017\u000b�i�������<�\u0003cӇ�=­\u0018����^}D�\u0016�.�t�\u0011\u0016O���u�#�\u0012��A���\u0003��\u0016�}�S\b��n:\u0002��N�\u0002o�_�UG|��TT��\u0000�\u0016o�휗��\u0005d��=�?y�T\u0011����r\\\u0011�Q)�<��\u0011��q�ųA@DՙEg/r���Hh������\f(�#$������Ig��n{��^q�{\np�ʆ�%T/��`�E\u0019���t`\b��jS\\0Z��\n�\\{�\u0007�p�Qo:�\u0012��\u001b�\u0015WH;\u001b+��-\u0011֡�Ğ\r���x�;X�A5�_0��^�\u0006\\�^�\f��˝K�q�\t1��Nƨ\u0018rMzB��G�\u0013BX,�تŔ}���:���#8�9��'Gf�4��x��Ў,��f�|��\f�ry��ʥ�0O\b�ɠ\u0002�?��퐮\u0006\u0018\u0015jZy@��ܒ�\u0005!\u000e<\u001c0)2�\u0013Z��3j�\u0005\u0010��_�e,���Y4\u0006G�۠���5\u0011K�d��#\n�@��$2����X\u0014��{WU|2Z�r��F��1�q�A\u0007��н\u0019\"�D�\"~�'�\u0011\f�[�JT31�Ln(^�\r�78\u001e\u0004\u0012\u0006��Q\u000b��?۫5�H����\u0004!'�V�ny�s�F�<\u0005!+&��T>�_\u0006�~�'\u0014w\u0007{�\u0011��_R��ް�!l��*���\u0002&yU�\u0012�¼J%�醐o��8��ᡎ8ұ�\u0011�DO����\u0010\":.|�P�78�\u000b�\"b��?\u001f��w\u0014l\u0007�D\u0001���\r����\u0011\u000e\u001c_�\u0003��yze�\u0018�{E\u0016��*�\u0003\u0000F\b3\t�b��4v\u000f�b0��\u0004C�[6|v \u0001m.�R\u0015�ZL0��-����ܻ�h���l�\u000f\u0012Wͷ�˻�.��\u000f1\u00019k�!\u0017z_�q�!q\f�XS��\\����N�A��\"x��|G��(��ͤ�!F�\rx�\u001aD%aW\u0011��t\u0000�\u001f�f�\u001e6\u0015Dz���\u000bԇU�e%P,L�����S�[��\u0001w��P�\u0000�\u001b�߅��Xj\u001e��Kv`^�H\u0010-a\u001cJ}\u001b���&\u0006\"�;+��)tPH��\nc\\��\f��\u000fQɇ�R�P��Q~�*/T����nru\u000f�\\�I�5Wd��v`��ZS=u�\u0006�[�|e�-r�� �:\u000e\u0002��A�8:�EڬÛT�8�<\b�z�B�X���-�.�\u0016d\u000bSBu�+,�\f\u0015\u0000\f��^Q�l��x��K��\u001c;�}li��s#�\u0005�W7�3��6�࿔�f��\u001e�vL\u0011iPwE���\u001f�nߵ\u001d���߮d�z��\u0002\u0018uC��0s�y\u001a!�՟����4\u001f\u0003����A��&c���a��a��H\u000f\u0010\u0015y`l��-��C��ʄ�e\bo�\u001c����\u0007�Ț\u0005$�/��n(���Q`NW\u0001k\u0014\u001fm��p\\�9t\u000f܃�\u0003�0e7��\r`�r\u0012p�A�G�\u000f\r�[��zb2�5Y��\u0013��\u0012\u0002����\u0001K�m�{C�ڤb�F��H�*,�<\u0010zW�+�-$�4T\u0014��h�h�\u0000\u0000\u0004a�)9�%\u0011�\u001c�\u001a�1+�\u0011ξ�\"/c\u001f�3|T�\u0004��p���P\u0010\f\u0004h\u0002`��\n\u0015ȃ�D@��!����\u0000�����\u0011\u0002\u001d6M�\u000e�ZTfe�\u0003��Vi\n��g��fј���h/\u0001\u001dP\u0016I\u0005\u00070E��\u001b�2�h|\u000f� L�\u0003DJ�,��m0�wᰞ (�\u0004�nY:3ʕ�����J�M���\u0004\u0006�cX:\u0016����b�0v���Y&j��\u001eB��ڴX\u001b�\u000f�.�嚿L�����{3�2�dm����ǍE\u0019l\u0018�\u000e�rˢ\u0001���H�S��E3�W�jTR����>�\u001a�1�*){\u000e\u000b�G�8\u0015\u0011���d\u000f�4\u001e�\u0012�!�W\u001dQ0\u0001f��2eooG�\u0012\u0002�K\u0005�H\u0010�O\u0018��lZ�2�8`���\u0000K �_���τȯ\u000f`�6\u0006I7/\u0012�x�\u0012ĉ(xY�h\u0000�\u0000y�C�k4�\\�'�K\u0010ǡ��\u0019�X�\\Sʍ吆\u0007TSa�I�QՄow)�b�~jĔ��\u001fH��\u001f�4\u001e�X/\u000f\u0017H��P4��\u0007�9r�kԉ\u0004�\u001cNe=�:P�C�p6��\u0015\u0002��\"\rsc��.G�\u001fP�=�l\u001f\rM�V�ܳ\u0017�0��\b\n\r�X�#����N�{\u0004e\u0001\u001e�\u0014���PT�US�����5ʻ|Yt��7�J�9@Y�\b�e��\u0012ƛUS\u0019�M����Vz`�-��rmg���s�JҊ\u0004k\u001e�4�٥�[ǜ�Q�V�w�*\b���\u0007�\u0015\u001bMW\u0005UEk�F_�-5\u000f4Mّ\"�r�\u000e�]\u00014�O]Ħ�\u0000��\u0000�>+�s���i��.8g��o�\u0007.�Y����5�|,\u0012-��Ms۶Y\u001c\u0005�h���u�Ɯ�\"�L��\u0011ۂ��\n��Bv@�~s��Y'8+*�YY��aE�s�ׅ�E�\u0001�\u000b�{ k��\u0000\u0000�W8)b�S�Q�\u000eň�\r��r%�h�V+3i��FN\u0014K�[ξ\u0006����}W��ӷ}��3\u001d��������������\u001f�O�����Ջ;Y��\u000f\u0007/�d}u�\\\u001f�-^�\u001b�,�6ӧA��p��iי�Ԯ��\u0002q��\u001aY\u001b('\u0000u\u001d��`\f\u0006��A[V\u0006R\u0001�,q����t��ѫ[\u001fX�swm%��Z֧V��|ju�rp\u0013�U=���/��?��\u0016m�b�\u001eY�Cx\u001b��x��X�\u000e��\u0001"
  },
  {
    "title": "Indian Watchmaker Bets Big on Customized Manufacturing Lines",
    "source": "EE Times",
    "date": "2025-06-03",
    "link": "https://www.eetimes.com/indian-watchmaker-bets-big-on-customized-manufacturing-lines/",
    "text": "design Lines Industrial Control Designline Indian Watchmaker Bets Big on Customized Manufacturing Lines By Yashasvini Razdan 06.03.2025 0 Share Post Share on Facebook Share on Twitter Earlier this year, in February 2025, Safran Aircraft Engines signed a contract with Titan Engineering and Automation Limited (TEAL), an Indian firm that produces components for its LEAP engine’s low-pressure turbine. Production is expected to begin in 2026. While most Indians know Titan as a famous Indian watch brand, TEAL, which was born out of India’s watchmaking legacy, was once an internal division of Titan Company Ltd., a TATA Enterprise. Today, TEAL is a system integrator that has made headlines for delivering parts that are used in critical systems on aircraft like the A320neo, Boeing 787 and Sukhoi to the likes of Safran, Pratt & Whitney, Honeywell, HAL (Hindustan Aeronautics Ltd.) and Thales. But that is not all that TEAL does. TEAL operates across two distinct domains: automation solutions and high-precision manufacturing services, which include its aerospace and defense ventures. The company manufactures critical mechanical engine components with embedded or adjacent electronic controls, such as afterburner fuel bodies, engine starters, reverse thruster actuators and air management system parts for the latter. “If you are flying an A320neo, chances are it has several critical components built by us: reverse thrusters, flap actuators, engine starters,” said Sridhar Neelakantan, managing director of TEAL, in an interview with EE Times. “We also manufacture complex engine parts for aircraft like the Sukhoi, including after thrusters and fuel bodies. Even HAL’s Dhruv helicopters use engines that include components made here at TEAL.” Partner Content View All The Opportunity for Liquid Sensing By Infineon Technologies  06.05.2025 Ex-NASA Engineer Now Guiding Manufacturers to Greater Efficiency By MRPeasy   06.02.2025 Nine Compelling Reasons Why Menta eFPGA Is Essential for Achieving True Crypto Agility in Your ASIC or SoC By Menta  06.02.2025 But the less glamorous, yet equally critical, side of TEAL’s work lies in electronics manufacturing and semiconductor assembly, ranging from mobile phone lines to EV battery pack production for clients like TVS, ABB and TATA Electronics. The company builds intelligent systems that assemble, test and perfect the electronics that you and I use, long before these systems reach the factory floor. Neelakantan shared how the company quietly enables global electronics production through its automation solutions. “Manufacturing is only just coming to India at scale,” he said. “When that happens, certain aspects are best done through a lights-out factory. But to reach that point, you need a partner who can design and build the right systems from scratch.” Understanding TEAL’s business strategy TEAL works extensively in the automotive and electronics manufacturing services (EMS) sector. “Whether it is mobile phone manufacturing or the growing use of electronics in vehicles—motor controllers, battery management systems, on-board chargers—we are building turnkey assembly automation for these applications. In consumer electronics, we focus on the product assembly stage,” Neelakantan explained. Turnkey assembly of machines happening at TEAL’s Hosur manufacturing facility  in Tamil Nadu, India (Source: TEAL) With most equipment still being imported into India, TEAL sees a growing opportunity to build domestic capability—especially as production-linked incentive schemes gain traction. The company is also eyeing the evolving OSAT (Outsourced Semiconductor Assembly and Test) ecosystem in India for automating packaging, assembly and wafer handling, and is exploring adjacent opportunities in solar wafer and panel production, where the process chain is similar. At first glance, TEAL may appear to be going against the tide. Most of the equipment used in electronics manufacturing in India today, from assembly lines to wafer handlers, is still imported from China. It is faster, cheaper and often comes with the kind of scale Indian manufacturers are only beginning to build. But Neelakantan said that TEAL’s offerings sit outside the typical price-versus-performance comparison. “Typically, when a customer is launching a new product, their engineering teams—design, manufacturing, maintenance—all come together to define the requirements. We co-develop the line with them. Only after that does the discussion move to procurement,” he said. TEAL’s aerospace and defense plant in Hosur, Tamil Nadu, India (Source: TEAL) This approach matters when a product is still evolving, as is often the case in new sectors like EVs, battery modules or telecom hardware. By co-developing manufacturing lines with their customers, TEAL accounts for real-world production challenges and provides local support when issues arise. “Some customers have strong in-house manufacturing and maintenance teams and prefer to handle everything themselves. In such cases, we train them and hand over the system,” Neelakantan said. “However, when complex retrofitting or upgrades are needed, customers return to us. In some cases, we also take complete ownership of maintaining the equipment. It depends on the customer’s preference and operational needs.” Export markets and infrastructure While TEAL began with Indian projects in the 1990s, the company has since expanded heavily into Europe, with installations in France, Spain, Germany, Sweden, Romania, the Czech Republi, and Hungary. “In Europe, the cost of labor is high, so the degree of automation is higher,” Neelakantan said. “We have done projects there with ticket sizes between ₹700 million [$8.2 million] and ₹1 billion [$11.75 million].” TEAL is now building a team in North America, with plans to expand in Mexico and the US. It is also eyeing Southeast Asia. In India, the company operates three automation facilities and one aerospace manufacturing facility in Hosur, Tamil Nadu, along with another facility in Chennai for EMS—all currently being expanded. Core design and assembly are done in-house, while non-critical components are sourced through a domestic supplier network. TEAL’s Hosur facility from outside (Source: TEAL) “We control the critical tasks and outsource special processes—like chemical treatments—only if approved by the customer,” Neelakantan explained. “In aerospace component manufacturing, many customers do not allow extensive outsourcing. So, we do most of it in-house.” Innovation, skills and a push for self-reliance The company integrates a wide mix of technologies— robotics , PLCs, sensors, servo systems, pneumatics—and adds software intelligence through its own platforms. “We have already started on the journey. We have our own solution for Industry 4.0, which we call I4 Metrics,” Neelakantan said. “It complements our equipment and gives our customers greater transparency of data.” TEAL has also developed its own vision systems using deep learning. These come in handy in cases where visual inspection involves subjective judgment—something better handled by AI than rule-based logic. But engineering innovation is only part of the story. The shortage of practically trained engineers remains a major bottleneck. To address that, TEAL plans to run internal upskilling programs and collaborate with IIT Madras, state governments and skilling institutes to improve engineering education. The company employs over 700 engineers in mechanical design, control systems and robotics. “We have to transform how we teach engineering and make it more relevant,” Neelakantan said. Building in India, sourcing globally While TEAL builds complete turnkey automation lines, many of the components that go into those systems are still imported. “Automation, of course, has a lot of components—systems, sensors, electronics,” Neelakantan explained. “These come from various parts of the world. Robots, PLCs, servomotors, pneumatics, hydraulics—most are not made in India.” The rest of the solution—design, fabrication, integration and testing—is done locally. “There is a high degree of engineering content in what we do. We give a complete turnkey solution, build the whole line, test it here, and then take it to the customer,” he said. Around 25–30% of the material is imported, with the majority of the value built in India, according to Neelakantan. While imported machines still dominate the Indian market, Neelakantan believes that with the right policy support, India can become a serious player in automation and capital equipment manufacturing. “This is an inflection point for India as far as manufacturing is concerned,” he said. “As sectors like EVs, batteries, solar and semiconductors grow, we see a strong future, not just in India but globally.” Chinese machines still undercut Indian alternatives upfront, but over time, once you add logistics, downtime, retrofitting and lack of onsite support, the cost gap narrows. While TEAL may not compete in terms of price, the company claims to offer greater control, reliability and co-engineering value. With the Indian government tightening indigenization rules—especially in defense and consumer electronics—a local supply chain automation partner becomes an evident choice rather than an optional one. RELATED TOPICS: INDUSTRIAL CONTROL Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Yashasvini Razdan Yashasvini Razdan is the Senior India Correspondent for EE Times. With a bachelor’s degree in electronic engineering from Mumbai University and a post-graduate diploma in business journalism, she has served in various senior editorial roles in leading Indian electronics and business publications, where she reported on semiconductor innovations, deep tech startups and the Indian electronics ecosystem. She is passionate about combining her technical know-how and journalistic acumen to chronicle the evolution of India’s electronics ecosystem for a global audience. 0 comments Post Comment Leave a Reply Cancel reply You must Register or Login to post a comment. This site uses Akismet to reduce spam. Learn how your comment data is processed ."
  }
]